<?php

namespace App\Http\Controllers;

use App\Libray\Encryption;
use App\Libray\Response;
use App\Models\Account;
use App\Models\Admin;
use App\Models\Good;
use App\Models\Manager;
use App\Models\ManagerCarte;
use App\Service\MenuService;
use Illuminate\Http\Request;
use Illuminate\Support\Facades\Redis;
use Illuminate\Support\Facades\Session;
use DB;

class LoginController extends Controller
{
    public function update(Good $good)
    {
        $Item = array (
            0 =>
                array (
                    'name' => '空数据',
                ),
            1001001 =>
                array (
                    'name' => '角色等级',
                ),
            1001002 =>
                array (
                    'name' => '经验',
                ),
            1001003 =>
                array (
                    'name' => '角色境界',
                ),
            1001004 =>
                array (
                    'name' => '灵石',
                ),
            1001005 =>
                array (
                    'name' => '仙玉',
                ),
            1001006 =>
                array (
                    'name' => 'VIP经验',
                ),
            1001007 =>
                array (
                    'name' => '修为',
                ),
            1001008 =>
                array (
                    'name' => '快速扫荡次数',
                ),
            1001009 =>
                array (
                    'name' => '快速扫荡次数上限',
                ),
            1001010 =>
                array (
                    'name' => '上古剑冢探索次数',
                ),
            1001011 =>
                array (
                    'name' => '上古剑冢探索次数上限',
                ),
            1001012 =>
                array (
                    'name' => '魂能',
                ),
            1001013 =>
                array (
                    'name' => '魂能上限',
                ),
            1001014 =>
                array (
                    'name' => '奥义经验',
                ),
            1001015 =>
                array (
                    'name' => '奥义等级',
                ),
            1001016 =>
                array (
                    'name' => '活跃度',
                ),
            1001017 =>
                array (
                    'name' => '剑器经验',
                ),
            1001018 =>
                array (
                    'name' => '剑灵经验',
                ),
            1001019 =>
                array (
                    'name' => '论剑令',
                ),
            1001020 =>
                array (
                    'name' => '名望值',
                ),
            1001021 =>
                array (
                    'name' => '竞猜币',
                ),
            1001022 =>
                array (
                    'name' => '繁荣度',
                ),
            1001023 =>
                array (
                    'name' => '情报值',
                ),
            1001024 =>
                array (
                    'name' => '月卡剩余天数',
                ),
            1001025 =>
                array (
                    'name' => '锁妖塔挑战次数',
                ),
            1001026 =>
                array (
                    'name' => '镇魔塔挑战次数',
                ),
            1001027 =>
                array (
                    'name' => '鸿蒙灵气',
                ),
            1001028 =>
                array (
                    'name' => '鸿蒙灵气',
                ),
            1001029 =>
                array (
                    'name' => '免费快速扫荡次数',
                ),
            1001030 =>
                array (
                    'name' => '剑神令特权',
                ),
            1001031 =>
                array (
                    'name' => '剑神令等级',
                ),
            1001032 =>
                array (
                    'name' => '剑神令经验',
                ),
            1001033 =>
                array (
                    'name' => '剑心经验',
                ),
            1001034 =>
                array (
                    'name' => '声望',
                ),
            1001035 =>
                array (
                    'name' => '声望等级',
                ),
            1001036 =>
                array (
                    'name' => '世界地图探索次数',
                ),
            1001037 =>
                array (
                    'name' => '膜拜次数',
                ),
            1001038 =>
                array (
                    'name' => '掌控者战挑战次数',
                ),
            1001039 =>
                array (
                    'name' => '十二葬地挑战次数',
                ),
            2010001 =>
                array (
                    'name' => '剑魄礼盒',
                ),
            2010002 =>
                array (
                    'name' => '剑器礼盒',
                ),
            2010003 =>
                array (
                    'name' => '剑器碎片礼盒',
                ),
            2010011 =>
                array (
                    'name' => '1级宝石礼盒',
                ),
            2010012 =>
                array (
                    'name' => '2级宝石礼盒',
                ),
            2010013 =>
                array (
                    'name' => '3级宝石礼盒',
                ),
            2010014 =>
                array (
                    'name' => '4级宝石礼盒',
                ),
            2010015 =>
                array (
                    'name' => '5级宝石礼盒',
                ),
            2010016 =>
                array (
                    'name' => '6级宝石礼盒',
                ),
            2010017 =>
                array (
                    'name' => '7级宝石礼盒',
                ),
            2010018 =>
                array (
                    'name' => '8级宝石礼盒',
                ),
            2010019 =>
                array (
                    'name' => '9级宝石礼盒',
                ),
            2010020 =>
                array (
                    'name' => '10级宝石礼盒',
                ),
            2011001 =>
                array (
                    'name' => '下品剑器礼盒',
                ),
            2011002 =>
                array (
                    'name' => '中品剑器礼盒',
                ),
            2011003 =>
                array (
                    'name' => '上品剑器礼盒',
                ),
            2011004 =>
                array (
                    'name' => '极品剑器礼盒',
                ),
            2011005 =>
                array (
                    'name' => '灵阶剑器礼盒',
                ),
            2011006 =>
                array (
                    'name' => '圣阶剑器礼盒',
                ),
            2011007 =>
                array (
                    'name' => '神阶剑器礼盒',
                ),
            2011101 =>
                array (
                    'name' => '下品剑器碎片礼盒',
                ),
            2011102 =>
                array (
                    'name' => '中品剑器碎片礼盒',
                ),
            2011103 =>
                array (
                    'name' => '上品剑器碎片礼盒',
                ),
            2011104 =>
                array (
                    'name' => '极品剑器碎片礼盒',
                ),
            2011105 =>
                array (
                    'name' => '灵阶剑器碎片礼盒',
                ),
            2011106 =>
                array (
                    'name' => '圣阶剑器碎片礼盒',
                ),
            2011107 =>
                array (
                    'name' => '神阶剑器碎片礼盒',
                ),
            2011201 =>
                array (
                    'name' => '下品丹药礼盒',
                ),
            2011202 =>
                array (
                    'name' => '中品丹药礼盒',
                ),
            2011203 =>
                array (
                    'name' => '上品丹药礼盒',
                ),
            2011204 =>
                array (
                    'name' => '极品丹药礼盒',
                ),
            2011205 =>
                array (
                    'name' => '王品丹药礼盒',
                ),
            2011206 =>
                array (
                    'name' => '皇品丹药礼盒',
                ),
            2011207 =>
                array (
                    'name' => '帝品丹药礼盒',
                ),
            2011301 =>
                array (
                    'name' => '下品灵宝礼盒',
                ),
            2011302 =>
                array (
                    'name' => '中品灵宝礼盒',
                ),
            2011303 =>
                array (
                    'name' => '上品灵宝礼盒',
                ),
            2011304 =>
                array (
                    'name' => '极品灵宝礼盒',
                ),
            2011305 =>
                array (
                    'name' => '王品灵宝礼盒',
                ),
            2011306 =>
                array (
                    'name' => '皇品灵宝礼盒',
                ),
            2011307 =>
                array (
                    'name' => '帝品灵宝礼盒',
                ),
            2181001 =>
                array (
                    'name' => '王品装备礼盒',
                ),
            2181002 =>
                array (
                    'name' => '皇品装备礼盒',
                ),
            2181003 =>
                array (
                    'name' => '帝品装备礼盒',
                ),
            2191001 =>
                array (
                    'name' => '任选下品剑器礼盒',
                ),
            2191002 =>
                array (
                    'name' => '任选中品剑器礼盒',
                ),
            2191003 =>
                array (
                    'name' => '任选上品剑器礼盒',
                ),
            2191004 =>
                array (
                    'name' => '任选极品剑器礼盒',
                ),
            2191005 =>
                array (
                    'name' => '任选灵阶剑器礼盒',
                ),
            2191006 =>
                array (
                    'name' => '任选圣阶剑器礼盒',
                ),
            2191007 =>
                array (
                    'name' => '任选神阶剑器礼盒',
                ),
            2021001 =>
                array (
                    'name' => '剑诀-天',
                ),
            2021002 =>
                array (
                    'name' => '剑诀-地',
                ),
            2021003 =>
                array (
                    'name' => '剑诀-玄',
                ),
            2021004 =>
                array (
                    'name' => '剑诀-黄',
                ),
            2022001 =>
                array (
                    'name' => '30分钟扫荡收益券',
                ),
            2022002 =>
                array (
                    'name' => '1小时扫荡收益券',
                ),
            2022003 =>
                array (
                    'name' => '2小时扫荡收益券',
                ),
            2022004 =>
                array (
                    'name' => '4小时扫荡收益券',
                ),
            2022005 =>
                array (
                    'name' => '8小时扫荡收益券',
                ),
            2031001 =>
                array (
                    'name' => '强化石',
                ),
            2031002 =>
                array (
                    'name' => '帝炎幽魂',
                ),
            2031003 =>
                array (
                    'name' => '改名卡',
                ),
            2031004 =>
                array (
                    'name' => '委托凭证',
                ),
            2031005 =>
                array (
                    'name' => '精炼石',
                ),
            2031006 =>
                array (
                    'name' => '铸魂石',
                ),
            2031007 =>
                array (
                    'name' => '附灵石',
                ),
            2031008 =>
                array (
                    'name' => '天荒剑令',
                ),
            2031011 =>
                array (
                    'name' => '丹药生命材料',
                ),
            2031012 =>
                array (
                    'name' => '丹药攻击材料',
                ),
            2031013 =>
                array (
                    'name' => '丹药防御材料',
                ),
            2031021 =>
                array (
                    'name' => '下品灵草',
                ),
            2031022 =>
                array (
                    'name' => '中品灵草',
                ),
            2031023 =>
                array (
                    'name' => '上品灵草',
                ),
            2031024 =>
                array (
                    'name' => '极品灵草',
                ),
            2031025 =>
                array (
                    'name' => '王品灵草',
                ),
            2031026 =>
                array (
                    'name' => '皇品灵草',
                ),
            2031027 =>
                array (
                    'name' => '帝品灵草',
                ),
            2031031 =>
                array (
                    'name' => '灵宝生命材料',
                ),
            2031032 =>
                array (
                    'name' => '灵宝攻击材料',
                ),
            2031033 =>
                array (
                    'name' => '灵宝防御材料',
                ),
            2031041 =>
                array (
                    'name' => '下品灵材',
                ),
            2031042 =>
                array (
                    'name' => '中品灵材',
                ),
            2031043 =>
                array (
                    'name' => '上品灵材',
                ),
            2031044 =>
                array (
                    'name' => '极品灵材',
                ),
            2031045 =>
                array (
                    'name' => '王品灵材',
                ),
            2031046 =>
                array (
                    'name' => '皇品灵材',
                ),
            2031047 =>
                array (
                    'name' => '帝品灵材',
                ),
            2031051 =>
                array (
                    'name' => '下品剑魄',
                ),
            2031052 =>
                array (
                    'name' => '中品剑魄',
                ),
            2031053 =>
                array (
                    'name' => '上品剑魄',
                ),
            2031054 =>
                array (
                    'name' => '极品剑魄',
                ),
            2031055 =>
                array (
                    'name' => '灵阶剑魄',
                ),
            2031056 =>
                array (
                    'name' => '圣阶剑魄',
                ),
            2031057 =>
                array (
                    'name' => '神阶剑魄',
                ),
            2031061 =>
                array (
                    'name' => '下品魂石',
                ),
            2031062 =>
                array (
                    'name' => '中品魂石',
                ),
            2031063 =>
                array (
                    'name' => '上品魂石',
                ),
            2031064 =>
                array (
                    'name' => '极品魂石',
                ),
            2031065 =>
                array (
                    'name' => '灵阶魂石',
                ),
            2031066 =>
                array (
                    'name' => '圣阶魂石',
                ),
            2031067 =>
                array (
                    'name' => '神阶魂石',
                ),
            2031071 =>
                array (
                    'name' => '鸿蒙灵气',
                ),
            2031072 =>
                array (
                    'name' => '九天息壤',
                ),
            2031073 =>
                array (
                    'name' => '陨铁',
                ),
            2031074 =>
                array (
                    'name' => '玄晶',
                ),
            2031075 =>
                array (
                    'name' => '玉符',
                ),
            2031076 =>
                array (
                    'name' => '圣羽',
                ),
            2031077 =>
                array (
                    'name' => '神魔令',
                ),
            2031078 =>
                array (
                    'name' => '秘宝券',
                ),
            2031079 =>
                array (
                    'name' => '论剑币',
                ),
            2031081 =>
                array (
                    'name' => '下品剑器碎片',
                ),
            2031082 =>
                array (
                    'name' => '中品剑器碎片',
                ),
            2031083 =>
                array (
                    'name' => '上品剑器碎片',
                ),
            2031084 =>
                array (
                    'name' => '极品剑器碎片',
                ),
            2031085 =>
                array (
                    'name' => '灵阶剑器碎片',
                ),
            2031086 =>
                array (
                    'name' => '圣阶剑器碎片',
                ),
            2031087 =>
                array (
                    'name' => '神阶剑器碎片',
                ),
            2031088 =>
                array (
                    'name' => '随机剑器碎片',
                ),
            2031091 =>
                array (
                    'name' => '剑心碎片',
                ),
            2031092 =>
                array (
                    'name' => '太白庚金',
                ),
            2031093 =>
                array (
                    'name' => '天灵玉髓',
                ),
            2031094 =>
                array (
                    'name' => '灵玉',
                ),
            2031095 =>
                array (
                    'name' => '灵韵',
                ),
            2036001 =>
                array (
                    'name' => '虚境·兽神之书',
                ),
            2036002 =>
                array (
                    'name' => '虚境·灵路之书',
                ),
            2021091 =>
                array (
                    'name' => '天级神魔令',
                ),
            2021092 =>
                array (
                    'name' => '地级神魔令',
                ),
            2021093 =>
                array (
                    'name' => '玄机神魔令',
                ),
            2021094 =>
                array (
                    'name' => '黄级神魔令',
                ),
            2041001 =>
                array (
                    'name' => '大还丹',
                ),
            2041002 =>
                array (
                    'name' => '抱元丹',
                ),
            2041003 =>
                array (
                    'name' => '淬骨丹',
                ),
            2041011 =>
                array (
                    'name' => '灵珑丹',
                ),
            2041012 =>
                array (
                    'name' => '龙虎丹',
                ),
            2041013 =>
                array (
                    'name' => '金鳌丹',
                ),
            2041021 =>
                array (
                    'name' => '驻颜丹',
                ),
            2041022 =>
                array (
                    'name' => '武阳丹',
                ),
            2041023 =>
                array (
                    'name' => '龙骨丹',
                ),
            2041031 =>
                array (
                    'name' => '不老长春丹',
                ),
            2041032 =>
                array (
                    'name' => '浴火麒麟丹',
                ),
            2041033 =>
                array (
                    'name' => '无垢玄晶丹',
                ),
            2041041 =>
                array (
                    'name' => '九转长生丹',
                ),
            2041042 =>
                array (
                    'name' => '九转真阳丹',
                ),
            2041043 =>
                array (
                    'name' => '九转紫金丹',
                ),
            2041051 =>
                array (
                    'name' => '阴阳紫虚丹',
                ),
            2041052 =>
                array (
                    'name' => '阴阳造化丹',
                ),
            2041053 =>
                array (
                    'name' => '阴阳玄极丹',
                ),
            2041061 =>
                array (
                    'name' => '太乙天尊丹',
                ),
            2041062 =>
                array (
                    'name' => '天道无极丹',
                ),
            2041063 =>
                array (
                    'name' => '摩诃无量丹',
                ),
            2042001 =>
                array (
                    'name' => '下品生命灵宝',
                ),
            2042002 =>
                array (
                    'name' => '下品攻击灵宝',
                ),
            2042003 =>
                array (
                    'name' => '下品防御灵宝',
                ),
            2042011 =>
                array (
                    'name' => '中品生命灵宝',
                ),
            2042012 =>
                array (
                    'name' => '中品攻击灵宝',
                ),
            2042013 =>
                array (
                    'name' => '中品防御灵宝',
                ),
            2042021 =>
                array (
                    'name' => '上品生命灵宝',
                ),
            2042022 =>
                array (
                    'name' => '上品攻击灵宝',
                ),
            2042023 =>
                array (
                    'name' => '上品防御灵宝',
                ),
            2042031 =>
                array (
                    'name' => '极品生命灵宝',
                ),
            2042032 =>
                array (
                    'name' => '极品攻击灵宝',
                ),
            2042033 =>
                array (
                    'name' => '极品防御灵宝',
                ),
            2042041 =>
                array (
                    'name' => '王品生命灵宝',
                ),
            2042042 =>
                array (
                    'name' => '王品攻击灵宝',
                ),
            2042043 =>
                array (
                    'name' => '王品防御灵宝',
                ),
            2042051 =>
                array (
                    'name' => '皇品生命灵宝',
                ),
            2042052 =>
                array (
                    'name' => '皇品攻击灵宝',
                ),
            2042053 =>
                array (
                    'name' => '皇品防御灵宝',
                ),
            2042061 =>
                array (
                    'name' => '帝品生命灵宝',
                ),
            2042062 =>
                array (
                    'name' => '帝品攻击灵宝',
                ),
            2042063 =>
                array (
                    'name' => '帝品防御灵宝',
                ),
            7041001 =>
                array (
                    'name' => '已废弃',
                ),
            7041002 =>
                array (
                    'name' => '已废弃',
                ),
            7041003 =>
                array (
                    'name' => '已废弃',
                ),
            7041004 =>
                array (
                    'name' => '已废弃',
                ),
            7042001 =>
                array (
                    'name' => '已废弃',
                ),
            7042002 =>
                array (
                    'name' => '已废弃',
                ),
            7042003 =>
                array (
                    'name' => '已废弃',
                ),
            7042004 =>
                array (
                    'name' => '已废弃',
                ),
            7042005 =>
                array (
                    'name' => '已废弃',
                ),
            7042006 =>
                array (
                    'name' => '已废弃',
                ),
            7042007 =>
                array (
                    'name' => '已废弃',
                ),
            7043001 =>
                array (
                    'name' => '已废弃',
                ),
            7043002 =>
                array (
                    'name' => '已废弃',
                ),
            7043003 =>
                array (
                    'name' => '已废弃',
                ),
            7043004 =>
                array (
                    'name' => '已废弃',
                ),
            7043005 =>
                array (
                    'name' => '已废弃',
                ),
            7043006 =>
                array (
                    'name' => '已废弃',
                ),
            7043007 =>
                array (
                    'name' => '已废弃',
                ),
            7043008 =>
                array (
                    'name' => '已废弃',
                ),
            7043009 =>
                array (
                    'name' => '已废弃',
                ),
            7043010 =>
                array (
                    'name' => '已废弃',
                ),
            7044001 =>
                array (
                    'name' => '已废弃',
                ),
            7044002 =>
                array (
                    'name' => '已废弃',
                ),
            7044003 =>
                array (
                    'name' => '已废弃',
                ),
            7044011 =>
                array (
                    'name' => '已废弃',
                ),
            7044012 =>
                array (
                    'name' => '已废弃',
                ),
            7044013 =>
                array (
                    'name' => '已废弃',
                ),
            7044014 =>
                array (
                    'name' => '已废弃',
                ),
            7044021 =>
                array (
                    'name' => '已废弃',
                ),
            7044022 =>
                array (
                    'name' => '已废弃',
                ),
            7044023 =>
                array (
                    'name' => '已废弃',
                ),
            7044024 =>
                array (
                    'name' => '已废弃',
                ),
            7044025 =>
                array (
                    'name' => '已废弃',
                ),
            7044101 =>
                array (
                    'name' => '已废弃',
                ),
            7044102 =>
                array (
                    'name' => '已废弃',
                ),
            7044103 =>
                array (
                    'name' => '已废弃',
                ),
            7044111 =>
                array (
                    'name' => '已废弃',
                ),
            7044112 =>
                array (
                    'name' => '已废弃',
                ),
            7044113 =>
                array (
                    'name' => '已废弃',
                ),
            7044114 =>
                array (
                    'name' => '已废弃',
                ),
            7044121 =>
                array (
                    'name' => '已废弃',
                ),
            7044122 =>
                array (
                    'name' => '已废弃',
                ),
            7044123 =>
                array (
                    'name' => '已废弃',
                ),
            7044124 =>
                array (
                    'name' => '已废弃',
                ),
            7044125 =>
                array (
                    'name' => '已废弃',
                ),
            7044201 =>
                array (
                    'name' => '已废弃',
                ),
            7044202 =>
                array (
                    'name' => '已废弃',
                ),
            7044203 =>
                array (
                    'name' => '已废弃',
                ),
            7044211 =>
                array (
                    'name' => '已废弃',
                ),
            7044212 =>
                array (
                    'name' => '已废弃',
                ),
            7044213 =>
                array (
                    'name' => '已废弃',
                ),
            7044214 =>
                array (
                    'name' => '已废弃',
                ),
            7044221 =>
                array (
                    'name' => '已废弃',
                ),
            7044222 =>
                array (
                    'name' => '已废弃',
                ),
            7044223 =>
                array (
                    'name' => '已废弃',
                ),
            7044224 =>
                array (
                    'name' => '已废弃',
                ),
            7044225 =>
                array (
                    'name' => '已废弃',
                ),
            2051001 =>
                array (
                    'name' => '已废弃',
                ),
            2051002 =>
                array (
                    'name' => '已废弃',
                ),
            2051003 =>
                array (
                    'name' => '已废弃',
                ),
            2051004 =>
                array (
                    'name' => '已废弃',
                ),
            2052001 =>
                array (
                    'name' => '已废弃',
                ),
            2052002 =>
                array (
                    'name' => '已废弃',
                ),
            2052003 =>
                array (
                    'name' => '已废弃',
                ),
            2052004 =>
                array (
                    'name' => '已废弃',
                ),
            2052005 =>
                array (
                    'name' => '已废弃',
                ),
            2052006 =>
                array (
                    'name' => '已废弃',
                ),
            2052007 =>
                array (
                    'name' => '已废弃',
                ),
            2053001 =>
                array (
                    'name' => '已废弃',
                ),
            2053002 =>
                array (
                    'name' => '已废弃',
                ),
            2053003 =>
                array (
                    'name' => '已废弃',
                ),
            2053004 =>
                array (
                    'name' => '已废弃',
                ),
            2053005 =>
                array (
                    'name' => '已废弃',
                ),
            2053006 =>
                array (
                    'name' => '已废弃',
                ),
            2053007 =>
                array (
                    'name' => '已废弃',
                ),
            2053008 =>
                array (
                    'name' => '已废弃',
                ),
            2053009 =>
                array (
                    'name' => '已废弃',
                ),
            2053010 =>
                array (
                    'name' => '已废弃',
                ),
            2054001 =>
                array (
                    'name' => '已废弃',
                ),
            2054002 =>
                array (
                    'name' => '已废弃',
                ),
            2054003 =>
                array (
                    'name' => '已废弃',
                ),
            2054011 =>
                array (
                    'name' => '已废弃',
                ),
            2054012 =>
                array (
                    'name' => '已废弃',
                ),
            2054013 =>
                array (
                    'name' => '已废弃',
                ),
            2054014 =>
                array (
                    'name' => '已废弃',
                ),
            2054021 =>
                array (
                    'name' => '已废弃',
                ),
            2054022 =>
                array (
                    'name' => '已废弃',
                ),
            2054023 =>
                array (
                    'name' => '已废弃',
                ),
            2054024 =>
                array (
                    'name' => '已废弃',
                ),
            2054025 =>
                array (
                    'name' => '已废弃',
                ),
            2054101 =>
                array (
                    'name' => '已废弃',
                ),
            2054102 =>
                array (
                    'name' => '已废弃',
                ),
            2054103 =>
                array (
                    'name' => '已废弃',
                ),
            2054111 =>
                array (
                    'name' => '已废弃',
                ),
            2054112 =>
                array (
                    'name' => '已废弃',
                ),
            2054113 =>
                array (
                    'name' => '已废弃',
                ),
            2054114 =>
                array (
                    'name' => '已废弃',
                ),
            2054121 =>
                array (
                    'name' => '已废弃',
                ),
            2054122 =>
                array (
                    'name' => '已废弃',
                ),
            2054123 =>
                array (
                    'name' => '已废弃',
                ),
            2054124 =>
                array (
                    'name' => '已废弃',
                ),
            2054125 =>
                array (
                    'name' => '已废弃',
                ),
            2054201 =>
                array (
                    'name' => '已废弃',
                ),
            2054202 =>
                array (
                    'name' => '已废弃',
                ),
            2054203 =>
                array (
                    'name' => '已废弃',
                ),
            2054211 =>
                array (
                    'name' => '已废弃',
                ),
            2054212 =>
                array (
                    'name' => '已废弃',
                ),
            2054213 =>
                array (
                    'name' => '已废弃',
                ),
            2054214 =>
                array (
                    'name' => '已废弃',
                ),
            2054221 =>
                array (
                    'name' => '已废弃',
                ),
            2054222 =>
                array (
                    'name' => '已废弃',
                ),
            2054223 =>
                array (
                    'name' => '已废弃',
                ),
            2054224 =>
                array (
                    'name' => '已废弃',
                ),
            2054225 =>
                array (
                    'name' => '已废弃',
                ),
            2061001 =>
                array (
                    'name' => '掩日剑-剑灵',
                ),
            2061002 =>
                array (
                    'name' => '惊月剑-剑灵',
                ),
            2061003 =>
                array (
                    'name' => '摘星剑-剑灵',
                ),
            2061004 =>
                array (
                    'name' => '破辰剑-剑灵',
                ),
            2062001 =>
                array (
                    'name' => '大矩-剑灵',
                ),
            2062002 =>
                array (
                    'name' => '煌灭-剑灵',
                ),
            2062003 =>
                array (
                    'name' => '长目-剑灵',
                ),
            2062004 =>
                array (
                    'name' => '不嗔-剑灵',
                ),
            2062005 =>
                array (
                    'name' => '焚寂-剑灵',
                ),
            2062006 =>
                array (
                    'name' => '彗蚀-剑灵',
                ),
            2062007 =>
                array (
                    'name' => '绝云-剑灵',
                ),
            2063001 =>
                array (
                    'name' => '承影-剑灵',
                ),
            2063002 =>
                array (
                    'name' => '纯钧-剑灵',
                ),
            2063003 =>
                array (
                    'name' => '鱼肠-剑灵',
                ),
            2063004 =>
                array (
                    'name' => '莫邪-剑灵',
                ),
            2063005 =>
                array (
                    'name' => '干将-剑灵',
                ),
            2063006 =>
                array (
                    'name' => '七星龙渊-剑灵',
                ),
            2063007 =>
                array (
                    'name' => '泰阿-剑灵',
                ),
            2063008 =>
                array (
                    'name' => '赤霄-剑灵',
                ),
            2063009 =>
                array (
                    'name' => '湛卢-剑灵',
                ),
            2063010 =>
                array (
                    'name' => '轩辕夏禹-剑灵',
                ),
            2064001 =>
                array (
                    'name' => '两仪灵剑-剑灵',
                ),
            2064002 =>
                array (
                    'name' => '太阳剑-剑灵',
                ),
            2064003 =>
                array (
                    'name' => '太阴剑-剑灵',
                ),
            2064011 =>
                array (
                    'name' => '混沌圣剑-剑灵',
                ),
            2064012 =>
                array (
                    'name' => '青萍剑-剑灵',
                ),
            2064013 =>
                array (
                    'name' => '太乙剑-剑灵',
                ),
            2064014 =>
                array (
                    'name' => '四宝剑-剑灵',
                ),
            2064021 =>
                array (
                    'name' => '终焉神剑-剑灵',
                ),
            2064022 =>
                array (
                    'name' => '离殇剑-剑灵',
                ),
            2064023 =>
                array (
                    'name' => '空冥剑-剑灵',
                ),
            2064024 =>
                array (
                    'name' => '湮灭剑-剑灵',
                ),
            2064025 =>
                array (
                    'name' => '永寂剑-剑灵',
                ),
            2064101 =>
                array (
                    'name' => '乾坤灵剑-剑灵',
                ),
            2064102 =>
                array (
                    'name' => '大荒剑-剑灵',
                ),
            2064103 =>
                array (
                    'name' => '囚天剑-剑灵',
                ),
            2064111 =>
                array (
                    'name' => '苍穹圣剑-剑灵',
                ),
            2064112 =>
                array (
                    'name' => '火莲剑-剑灵',
                ),
            2064113 =>
                array (
                    'name' => '龙凰剑-剑灵',
                ),
            2064114 =>
                array (
                    'name' => '帝焱剑-剑灵',
                ),
            2064121 =>
                array (
                    'name' => '大主宰神剑-剑灵',
                ),
            2064122 =>
                array (
                    'name' => '洛神剑-剑灵',
                ),
            2064123 =>
                array (
                    'name' => '天帝剑-剑灵',
                ),
            2064124 =>
                array (
                    'name' => '镇魔剑-剑灵',
                ),
            2064125 =>
                array (
                    'name' => '须弥剑-剑灵',
                ),
            2064201 =>
                array (
                    'name' => '太虚灵剑-剑灵',
                ),
            2064202 =>
                array (
                    'name' => '无极剑-剑灵',
                ),
            2064203 =>
                array (
                    'name' => '森罗剑-剑灵',
                ),
            2064211 =>
                array (
                    'name' => '诸天圣剑-剑灵',
                ),
            2064212 =>
                array (
                    'name' => '空痕剑-剑灵',
                ),
            2064213 =>
                array (
                    'name' => '葬天剑-剑灵',
                ),
            2064214 =>
                array (
                    'name' => '枯苍剑 -剑灵',
                ),
            2064221 =>
                array (
                    'name' => '诛仙神剑-剑灵',
                ),
            2064222 =>
                array (
                    'name' => '合欢剑-剑灵',
                ),
            2064223 =>
                array (
                    'name' => '天琊剑-剑灵',
                ),
            2064224 =>
                array (
                    'name' => '噬魂剑-剑灵',
                ),
            2064225 =>
                array (
                    'name' => '鬼王剑-剑灵',
                ),
            2071001 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2071002 =>
                array (
                    'name' => '星尘披风',
                ),
            2071003 =>
                array (
                    'name' => '星尘护手',
                ),
            2071004 =>
                array (
                    'name' => '星尘腰带',
                ),
            2071005 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2071006 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2071011 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2071012 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2071013 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2071014 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2071015 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2071016 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2071021 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2071022 =>
                array (
                    'name' => '螭龙披风',
                ),
            2071023 =>
                array (
                    'name' => '螭龙护手',
                ),
            2071024 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2071025 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2071026 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2071031 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2071032 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2071033 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2071034 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2071035 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2071036 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2071041 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2071042 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2071043 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2071044 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2071045 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2071046 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2071051 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2071052 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2071053 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2071054 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2071055 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2071056 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2071061 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2071062 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2071063 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2071064 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2071065 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2071066 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2071101 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2071102 =>
                array (
                    'name' => '星尘披风',
                ),
            2071103 =>
                array (
                    'name' => '星尘护手',
                ),
            2071104 =>
                array (
                    'name' => '星尘腰带',
                ),
            2071105 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2071106 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2071111 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2071112 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2071113 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2071114 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2071115 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2071116 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2071121 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2071122 =>
                array (
                    'name' => '螭龙披风',
                ),
            2071123 =>
                array (
                    'name' => '螭龙护手',
                ),
            2071124 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2071125 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2071126 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2071131 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2071132 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2071133 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2071134 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2071135 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2071136 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2071141 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2071142 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2071143 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2071144 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2071145 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2071146 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2071151 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2071152 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2071153 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2071154 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2071155 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2071156 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2071161 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2071162 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2071163 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2071164 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2071165 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2071166 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2071201 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2071202 =>
                array (
                    'name' => '星尘披风',
                ),
            2071203 =>
                array (
                    'name' => '星尘护手',
                ),
            2071204 =>
                array (
                    'name' => '星尘腰带',
                ),
            2071205 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2071206 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2071211 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2071212 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2071213 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2071214 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2071215 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2071216 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2071221 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2071222 =>
                array (
                    'name' => '螭龙披风',
                ),
            2071223 =>
                array (
                    'name' => '螭龙护手',
                ),
            2071224 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2071225 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2071226 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2071231 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2071232 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2071233 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2071234 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2071235 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2071236 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2071241 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2071242 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2071243 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2071244 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2071245 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2071246 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2071251 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2071252 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2071253 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2071254 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2071255 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2071256 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2071261 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2071262 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2071263 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2071264 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2071265 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2071266 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2071301 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2071302 =>
                array (
                    'name' => '星尘披风',
                ),
            2071303 =>
                array (
                    'name' => '星尘护手',
                ),
            2071304 =>
                array (
                    'name' => '星尘腰带',
                ),
            2071305 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2071306 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2071311 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2071312 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2071313 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2071314 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2071315 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2071316 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2071321 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2071322 =>
                array (
                    'name' => '螭龙披风',
                ),
            2071323 =>
                array (
                    'name' => '螭龙护手',
                ),
            2071324 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2071325 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2071326 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2071331 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2071332 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2071333 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2071334 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2071335 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2071336 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2071341 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2071342 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2071343 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2071344 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2071345 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2071346 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2071351 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2071352 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2071353 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2071354 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2071355 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2071356 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2071361 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2071362 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2071363 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2071364 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2071365 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2071366 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2071401 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2071402 =>
                array (
                    'name' => '星尘披风',
                ),
            2071403 =>
                array (
                    'name' => '星尘护手',
                ),
            2071404 =>
                array (
                    'name' => '星尘腰带',
                ),
            2071405 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2071406 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2071411 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2071412 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2071413 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2071414 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2071415 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2071416 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2071421 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2071422 =>
                array (
                    'name' => '螭龙披风',
                ),
            2071423 =>
                array (
                    'name' => '螭龙护手',
                ),
            2071424 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2071425 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2071426 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2071431 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2071432 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2071433 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2071434 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2071435 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2071436 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2071441 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2071442 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2071443 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2071444 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2071445 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2071446 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2071451 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2071452 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2071453 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2071454 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2071455 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2071456 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2071461 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2071462 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2071463 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2071464 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2071465 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2071466 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2071501 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2071502 =>
                array (
                    'name' => '星尘披风',
                ),
            2071503 =>
                array (
                    'name' => '星尘护手',
                ),
            2071504 =>
                array (
                    'name' => '星尘腰带',
                ),
            2071505 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2071506 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2071511 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2071512 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2071513 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2071514 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2071515 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2071516 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2071521 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2071522 =>
                array (
                    'name' => '螭龙披风',
                ),
            2071523 =>
                array (
                    'name' => '螭龙护手',
                ),
            2071524 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2071525 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2071526 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2071531 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2071532 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2071533 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2071534 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2071535 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2071536 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2071541 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2071542 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2071543 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2071544 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2071545 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2071546 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2071551 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2071552 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2071553 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2071554 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2071555 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2071556 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2071561 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2071562 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2071563 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2071564 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2071565 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2071566 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2071601 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2071602 =>
                array (
                    'name' => '星尘披风',
                ),
            2071603 =>
                array (
                    'name' => '星尘护手',
                ),
            2071604 =>
                array (
                    'name' => '星尘腰带',
                ),
            2071605 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2071606 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2071611 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2071612 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2071613 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2071614 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2071615 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2071616 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2071621 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2071622 =>
                array (
                    'name' => '螭龙披风',
                ),
            2071623 =>
                array (
                    'name' => '螭龙护手',
                ),
            2071624 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2071625 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2071626 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2071631 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2071632 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2071633 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2071634 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2071635 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2071636 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2071641 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2071642 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2071643 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2071644 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2071645 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2071646 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2071651 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2071652 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2071653 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2071654 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2071655 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2071656 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2071661 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2071662 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2071663 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2071664 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2071665 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2071666 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2071701 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2071702 =>
                array (
                    'name' => '星尘披风',
                ),
            2071703 =>
                array (
                    'name' => '星尘护手',
                ),
            2071704 =>
                array (
                    'name' => '星尘腰带',
                ),
            2071705 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2071706 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2071711 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2071712 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2071713 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2071714 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2071715 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2071716 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2071721 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2071722 =>
                array (
                    'name' => '螭龙披风',
                ),
            2071723 =>
                array (
                    'name' => '螭龙护手',
                ),
            2071724 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2071725 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2071726 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2071731 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2071732 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2071733 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2071734 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2071735 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2071736 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2071741 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2071742 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2071743 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2071744 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2071745 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2071746 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2071751 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2071752 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2071753 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2071754 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2071755 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2071756 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2071761 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2071762 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2071763 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2071764 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2071765 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2071766 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2071801 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2071802 =>
                array (
                    'name' => '星尘披风',
                ),
            2071803 =>
                array (
                    'name' => '星尘护手',
                ),
            2071804 =>
                array (
                    'name' => '星尘腰带',
                ),
            2071805 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2071806 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2071811 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2071812 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2071813 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2071814 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2071815 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2071816 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2071821 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2071822 =>
                array (
                    'name' => '螭龙披风',
                ),
            2071823 =>
                array (
                    'name' => '螭龙护手',
                ),
            2071824 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2071825 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2071826 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2071831 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2071832 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2071833 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2071834 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2071835 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2071836 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2071841 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2071842 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2071843 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2071844 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2071845 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2071846 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2071851 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2071852 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2071853 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2071854 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2071855 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2071856 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2071861 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2071862 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2071863 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2071864 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2071865 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2071866 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2071901 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2071902 =>
                array (
                    'name' => '星尘披风',
                ),
            2071903 =>
                array (
                    'name' => '星尘护手',
                ),
            2071904 =>
                array (
                    'name' => '星尘腰带',
                ),
            2071905 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2071906 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2071911 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2071912 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2071913 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2071914 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2071915 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2071916 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2071921 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2071922 =>
                array (
                    'name' => '螭龙披风',
                ),
            2071923 =>
                array (
                    'name' => '螭龙护手',
                ),
            2071924 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2071925 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2071926 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2071931 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2071932 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2071933 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2071934 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2071935 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2071936 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2071941 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2071942 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2071943 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2071944 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2071945 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2071946 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2071951 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2071952 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2071953 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2071954 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2071955 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2071956 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2071961 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2071962 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2071963 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2071964 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2071965 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2071966 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2072001 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2072002 =>
                array (
                    'name' => '星尘披风',
                ),
            2072003 =>
                array (
                    'name' => '星尘护手',
                ),
            2072004 =>
                array (
                    'name' => '星尘腰带',
                ),
            2072005 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2072006 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2072011 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2072012 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2072013 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2072014 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2072015 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2072016 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2072021 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2072022 =>
                array (
                    'name' => '螭龙披风',
                ),
            2072023 =>
                array (
                    'name' => '螭龙护手',
                ),
            2072024 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2072025 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2072026 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2072031 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2072032 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2072033 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2072034 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2072035 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2072036 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2072041 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2072042 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2072043 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2072044 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2072045 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2072046 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2072051 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2072052 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2072053 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2072054 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2072055 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2072056 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2072061 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2072062 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2072063 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2072064 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2072065 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2072066 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2072101 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2072102 =>
                array (
                    'name' => '星尘披风',
                ),
            2072103 =>
                array (
                    'name' => '星尘护手',
                ),
            2072104 =>
                array (
                    'name' => '星尘腰带',
                ),
            2072105 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2072106 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2072111 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2072112 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2072113 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2072114 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2072115 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2072116 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2072121 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2072122 =>
                array (
                    'name' => '螭龙披风',
                ),
            2072123 =>
                array (
                    'name' => '螭龙护手',
                ),
            2072124 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2072125 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2072126 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2072131 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2072132 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2072133 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2072134 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2072135 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2072136 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2072141 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2072142 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2072143 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2072144 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2072145 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2072146 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2072151 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2072152 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2072153 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2072154 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2072155 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2072156 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2072161 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2072162 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2072163 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2072164 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2072165 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2072166 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2072201 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2072202 =>
                array (
                    'name' => '星尘披风',
                ),
            2072203 =>
                array (
                    'name' => '星尘护手',
                ),
            2072204 =>
                array (
                    'name' => '星尘腰带',
                ),
            2072205 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2072206 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2072211 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2072212 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2072213 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2072214 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2072215 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2072216 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2072221 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2072222 =>
                array (
                    'name' => '螭龙披风',
                ),
            2072223 =>
                array (
                    'name' => '螭龙护手',
                ),
            2072224 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2072225 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2072226 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2072231 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2072232 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2072233 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2072234 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2072235 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2072236 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2072241 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2072242 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2072243 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2072244 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2072245 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2072246 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2072251 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2072252 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2072253 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2072254 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2072255 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2072256 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2072261 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2072262 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2072263 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2072264 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2072265 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2072266 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2072301 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2072302 =>
                array (
                    'name' => '星尘披风',
                ),
            2072303 =>
                array (
                    'name' => '星尘护手',
                ),
            2072304 =>
                array (
                    'name' => '星尘腰带',
                ),
            2072305 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2072306 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2072311 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2072312 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2072313 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2072314 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2072315 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2072316 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2072321 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2072322 =>
                array (
                    'name' => '螭龙披风',
                ),
            2072323 =>
                array (
                    'name' => '螭龙护手',
                ),
            2072324 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2072325 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2072326 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2072331 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2072332 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2072333 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2072334 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2072335 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2072336 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2072341 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2072342 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2072343 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2072344 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2072345 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2072346 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2072351 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2072352 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2072353 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2072354 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2072355 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2072356 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2072361 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2072362 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2072363 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2072364 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2072365 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2072366 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2072401 =>
                array (
                    'name' => '星尘宝冠',
                ),
            2072402 =>
                array (
                    'name' => '星尘披风',
                ),
            2072403 =>
                array (
                    'name' => '星尘护手',
                ),
            2072404 =>
                array (
                    'name' => '星尘腰带',
                ),
            2072405 =>
                array (
                    'name' => '星尘宝甲',
                ),
            2072406 =>
                array (
                    'name' => '星尘宝靴',
                ),
            2072411 =>
                array (
                    'name' => '狮蛮宝冠',
                ),
            2072412 =>
                array (
                    'name' => '狮蛮披风',
                ),
            2072413 =>
                array (
                    'name' => '狮蛮护手',
                ),
            2072414 =>
                array (
                    'name' => '狮蛮腰带',
                ),
            2072415 =>
                array (
                    'name' => '狮蛮宝甲',
                ),
            2072416 =>
                array (
                    'name' => '狮蛮宝靴',
                ),
            2072421 =>
                array (
                    'name' => '螭龙宝冠',
                ),
            2072422 =>
                array (
                    'name' => '螭龙披风',
                ),
            2072423 =>
                array (
                    'name' => '螭龙护手',
                ),
            2072424 =>
                array (
                    'name' => '螭龙腰带',
                ),
            2072425 =>
                array (
                    'name' => '螭龙宝甲',
                ),
            2072426 =>
                array (
                    'name' => '螭龙宝靴',
                ),
            2072431 =>
                array (
                    'name' => '明光皓月宝冠',
                ),
            2072432 =>
                array (
                    'name' => '明光皓月披风',
                ),
            2072433 =>
                array (
                    'name' => '明光皓月护手',
                ),
            2072434 =>
                array (
                    'name' => '明光皓月腰带',
                ),
            2072435 =>
                array (
                    'name' => '明光皓月宝甲',
                ),
            2072436 =>
                array (
                    'name' => '明光皓月宝靴',
                ),
            2072441 =>
                array (
                    'name' => '沧海玄冥之冠',
                ),
            2072442 =>
                array (
                    'name' => '沧海玄冥之护',
                ),
            2072443 =>
                array (
                    'name' => '沧海玄冥之手',
                ),
            2072444 =>
                array (
                    'name' => '沧海玄冥之束',
                ),
            2072445 =>
                array (
                    'name' => '沧海玄冥之甲',
                ),
            2072446 =>
                array (
                    'name' => '沧海玄冥之足',
                ),
            2072451 =>
                array (
                    'name' => '极天龙腾之冠',
                ),
            2072452 =>
                array (
                    'name' => '极天龙腾之氅',
                ),
            2072453 =>
                array (
                    'name' => '极天龙腾之手',
                ),
            2072454 =>
                array (
                    'name' => '极天龙腾之束',
                ),
            2072455 =>
                array (
                    'name' => '极天龙腾之甲',
                ),
            2072456 =>
                array (
                    'name' => '极天龙腾之足',
                ),
            2072461 =>
                array (
                    'name' => '炽羽凤翼之冠',
                ),
            2072462 =>
                array (
                    'name' => '炽羽凤翼之御',
                ),
            2072463 =>
                array (
                    'name' => '炽羽凤翼之手',
                ),
            2072464 =>
                array (
                    'name' => '炽羽凤翼之束',
                ),
            2072465 =>
                array (
                    'name' => '炽羽凤翼之甲',
                ),
            2072466 =>
                array (
                    'name' => '炽羽凤翼之足',
                ),
            2081001 =>
                array (
                    'name' => '白玉发簪',
                ),
            2081002 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2081003 =>
                array (
                    'name' => '白玉项链',
                ),
            2081004 =>
                array (
                    'name' => '白玉手镯',
                ),
            2081005 =>
                array (
                    'name' => '白玉戒指',
                ),
            2081006 =>
                array (
                    'name' => '白玉护符',
                ),
            2081011 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2081012 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2081013 =>
                array (
                    'name' => '飞仙项链',
                ),
            2081014 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2081015 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2081016 =>
                array (
                    'name' => '飞仙护符',
                ),
            2081021 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2081022 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2081023 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2081024 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2081025 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2081026 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2081031 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2081032 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2081033 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2081034 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2081035 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2081036 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2081041 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2081042 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2081043 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2081044 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2081045 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2081046 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2081051 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2081052 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2081053 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2081054 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2081055 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2081056 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2081061 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2081062 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2081063 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2081064 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2081065 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2081066 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2081101 =>
                array (
                    'name' => '白玉发簪',
                ),
            2081102 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2081103 =>
                array (
                    'name' => '白玉项链',
                ),
            2081104 =>
                array (
                    'name' => '白玉手镯',
                ),
            2081105 =>
                array (
                    'name' => '白玉戒指',
                ),
            2081106 =>
                array (
                    'name' => '白玉护符',
                ),
            2081111 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2081112 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2081113 =>
                array (
                    'name' => '飞仙项链',
                ),
            2081114 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2081115 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2081116 =>
                array (
                    'name' => '飞仙护符',
                ),
            2081121 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2081122 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2081123 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2081124 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2081125 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2081126 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2081131 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2081132 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2081133 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2081134 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2081135 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2081136 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2081141 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2081142 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2081143 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2081144 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2081145 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2081146 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2081151 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2081152 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2081153 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2081154 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2081155 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2081156 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2081161 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2081162 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2081163 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2081164 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2081165 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2081166 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2081201 =>
                array (
                    'name' => '白玉发簪',
                ),
            2081202 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2081203 =>
                array (
                    'name' => '白玉项链',
                ),
            2081204 =>
                array (
                    'name' => '白玉手镯',
                ),
            2081205 =>
                array (
                    'name' => '白玉戒指',
                ),
            2081206 =>
                array (
                    'name' => '白玉护符',
                ),
            2081211 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2081212 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2081213 =>
                array (
                    'name' => '飞仙项链',
                ),
            2081214 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2081215 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2081216 =>
                array (
                    'name' => '飞仙护符',
                ),
            2081221 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2081222 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2081223 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2081224 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2081225 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2081226 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2081231 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2081232 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2081233 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2081234 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2081235 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2081236 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2081241 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2081242 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2081243 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2081244 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2081245 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2081246 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2081251 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2081252 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2081253 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2081254 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2081255 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2081256 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2081261 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2081262 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2081263 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2081264 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2081265 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2081266 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2081301 =>
                array (
                    'name' => '白玉发簪',
                ),
            2081302 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2081303 =>
                array (
                    'name' => '白玉项链',
                ),
            2081304 =>
                array (
                    'name' => '白玉手镯',
                ),
            2081305 =>
                array (
                    'name' => '白玉戒指',
                ),
            2081306 =>
                array (
                    'name' => '白玉护符',
                ),
            2081311 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2081312 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2081313 =>
                array (
                    'name' => '飞仙项链',
                ),
            2081314 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2081315 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2081316 =>
                array (
                    'name' => '飞仙护符',
                ),
            2081321 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2081322 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2081323 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2081324 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2081325 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2081326 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2081331 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2081332 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2081333 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2081334 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2081335 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2081336 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2081341 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2081342 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2081343 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2081344 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2081345 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2081346 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2081351 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2081352 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2081353 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2081354 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2081355 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2081356 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2081361 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2081362 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2081363 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2081364 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2081365 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2081366 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2081401 =>
                array (
                    'name' => '白玉发簪',
                ),
            2081402 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2081403 =>
                array (
                    'name' => '白玉项链',
                ),
            2081404 =>
                array (
                    'name' => '白玉手镯',
                ),
            2081405 =>
                array (
                    'name' => '白玉戒指',
                ),
            2081406 =>
                array (
                    'name' => '白玉护符',
                ),
            2081411 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2081412 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2081413 =>
                array (
                    'name' => '飞仙项链',
                ),
            2081414 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2081415 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2081416 =>
                array (
                    'name' => '飞仙护符',
                ),
            2081421 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2081422 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2081423 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2081424 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2081425 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2081426 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2081431 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2081432 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2081433 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2081434 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2081435 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2081436 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2081441 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2081442 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2081443 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2081444 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2081445 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2081446 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2081451 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2081452 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2081453 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2081454 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2081455 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2081456 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2081461 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2081462 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2081463 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2081464 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2081465 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2081466 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2081501 =>
                array (
                    'name' => '白玉发簪',
                ),
            2081502 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2081503 =>
                array (
                    'name' => '白玉项链',
                ),
            2081504 =>
                array (
                    'name' => '白玉手镯',
                ),
            2081505 =>
                array (
                    'name' => '白玉戒指',
                ),
            2081506 =>
                array (
                    'name' => '白玉护符',
                ),
            2081511 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2081512 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2081513 =>
                array (
                    'name' => '飞仙项链',
                ),
            2081514 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2081515 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2081516 =>
                array (
                    'name' => '飞仙护符',
                ),
            2081521 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2081522 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2081523 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2081524 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2081525 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2081526 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2081531 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2081532 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2081533 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2081534 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2081535 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2081536 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2081541 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2081542 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2081543 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2081544 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2081545 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2081546 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2081551 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2081552 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2081553 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2081554 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2081555 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2081556 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2081561 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2081562 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2081563 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2081564 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2081565 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2081566 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2081601 =>
                array (
                    'name' => '白玉发簪',
                ),
            2081602 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2081603 =>
                array (
                    'name' => '白玉项链',
                ),
            2081604 =>
                array (
                    'name' => '白玉手镯',
                ),
            2081605 =>
                array (
                    'name' => '白玉戒指',
                ),
            2081606 =>
                array (
                    'name' => '白玉护符',
                ),
            2081611 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2081612 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2081613 =>
                array (
                    'name' => '飞仙项链',
                ),
            2081614 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2081615 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2081616 =>
                array (
                    'name' => '飞仙护符',
                ),
            2081621 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2081622 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2081623 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2081624 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2081625 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2081626 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2081631 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2081632 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2081633 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2081634 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2081635 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2081636 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2081641 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2081642 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2081643 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2081644 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2081645 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2081646 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2081651 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2081652 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2081653 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2081654 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2081655 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2081656 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2081661 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2081662 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2081663 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2081664 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2081665 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2081666 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2081701 =>
                array (
                    'name' => '白玉发簪',
                ),
            2081702 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2081703 =>
                array (
                    'name' => '白玉项链',
                ),
            2081704 =>
                array (
                    'name' => '白玉手镯',
                ),
            2081705 =>
                array (
                    'name' => '白玉戒指',
                ),
            2081706 =>
                array (
                    'name' => '白玉护符',
                ),
            2081711 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2081712 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2081713 =>
                array (
                    'name' => '飞仙项链',
                ),
            2081714 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2081715 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2081716 =>
                array (
                    'name' => '飞仙护符',
                ),
            2081721 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2081722 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2081723 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2081724 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2081725 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2081726 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2081731 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2081732 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2081733 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2081734 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2081735 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2081736 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2081741 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2081742 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2081743 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2081744 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2081745 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2081746 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2081751 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2081752 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2081753 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2081754 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2081755 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2081756 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2081761 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2081762 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2081763 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2081764 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2081765 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2081766 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2081801 =>
                array (
                    'name' => '白玉发簪',
                ),
            2081802 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2081803 =>
                array (
                    'name' => '白玉项链',
                ),
            2081804 =>
                array (
                    'name' => '白玉手镯',
                ),
            2081805 =>
                array (
                    'name' => '白玉戒指',
                ),
            2081806 =>
                array (
                    'name' => '白玉护符',
                ),
            2081811 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2081812 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2081813 =>
                array (
                    'name' => '飞仙项链',
                ),
            2081814 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2081815 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2081816 =>
                array (
                    'name' => '飞仙护符',
                ),
            2081821 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2081822 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2081823 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2081824 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2081825 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2081826 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2081831 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2081832 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2081833 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2081834 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2081835 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2081836 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2081841 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2081842 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2081843 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2081844 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2081845 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2081846 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2081851 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2081852 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2081853 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2081854 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2081855 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2081856 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2081861 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2081862 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2081863 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2081864 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2081865 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2081866 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2081901 =>
                array (
                    'name' => '白玉发簪',
                ),
            2081902 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2081903 =>
                array (
                    'name' => '白玉项链',
                ),
            2081904 =>
                array (
                    'name' => '白玉手镯',
                ),
            2081905 =>
                array (
                    'name' => '白玉戒指',
                ),
            2081906 =>
                array (
                    'name' => '白玉护符',
                ),
            2081911 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2081912 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2081913 =>
                array (
                    'name' => '飞仙项链',
                ),
            2081914 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2081915 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2081916 =>
                array (
                    'name' => '飞仙护符',
                ),
            2081921 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2081922 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2081923 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2081924 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2081925 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2081926 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2081931 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2081932 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2081933 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2081934 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2081935 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2081936 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2081941 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2081942 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2081943 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2081944 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2081945 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2081946 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2081951 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2081952 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2081953 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2081954 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2081955 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2081956 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2081961 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2081962 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2081963 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2081964 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2081965 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2081966 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2082001 =>
                array (
                    'name' => '白玉发簪',
                ),
            2082002 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2082003 =>
                array (
                    'name' => '白玉项链',
                ),
            2082004 =>
                array (
                    'name' => '白玉手镯',
                ),
            2082005 =>
                array (
                    'name' => '白玉戒指',
                ),
            2082006 =>
                array (
                    'name' => '白玉护符',
                ),
            2082011 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2082012 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2082013 =>
                array (
                    'name' => '飞仙项链',
                ),
            2082014 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2082015 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2082016 =>
                array (
                    'name' => '飞仙护符',
                ),
            2082021 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2082022 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2082023 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2082024 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2082025 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2082026 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2082031 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2082032 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2082033 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2082034 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2082035 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2082036 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2082041 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2082042 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2082043 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2082044 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2082045 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2082046 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2082051 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2082052 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2082053 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2082054 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2082055 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2082056 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2082061 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2082062 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2082063 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2082064 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2082065 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2082066 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2082101 =>
                array (
                    'name' => '白玉发簪',
                ),
            2082102 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2082103 =>
                array (
                    'name' => '白玉项链',
                ),
            2082104 =>
                array (
                    'name' => '白玉手镯',
                ),
            2082105 =>
                array (
                    'name' => '白玉戒指',
                ),
            2082106 =>
                array (
                    'name' => '白玉护符',
                ),
            2082111 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2082112 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2082113 =>
                array (
                    'name' => '飞仙项链',
                ),
            2082114 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2082115 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2082116 =>
                array (
                    'name' => '飞仙护符',
                ),
            2082121 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2082122 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2082123 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2082124 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2082125 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2082126 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2082131 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2082132 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2082133 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2082134 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2082135 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2082136 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2082141 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2082142 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2082143 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2082144 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2082145 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2082146 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2082151 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2082152 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2082153 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2082154 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2082155 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2082156 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2082161 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2082162 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2082163 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2082164 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2082165 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2082166 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2082201 =>
                array (
                    'name' => '白玉发簪',
                ),
            2082202 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2082203 =>
                array (
                    'name' => '白玉项链',
                ),
            2082204 =>
                array (
                    'name' => '白玉手镯',
                ),
            2082205 =>
                array (
                    'name' => '白玉戒指',
                ),
            2082206 =>
                array (
                    'name' => '白玉护符',
                ),
            2082211 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2082212 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2082213 =>
                array (
                    'name' => '飞仙项链',
                ),
            2082214 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2082215 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2082216 =>
                array (
                    'name' => '飞仙护符',
                ),
            2082221 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2082222 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2082223 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2082224 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2082225 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2082226 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2082231 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2082232 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2082233 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2082234 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2082235 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2082236 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2082241 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2082242 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2082243 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2082244 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2082245 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2082246 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2082251 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2082252 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2082253 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2082254 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2082255 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2082256 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2082261 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2082262 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2082263 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2082264 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2082265 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2082266 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2082301 =>
                array (
                    'name' => '白玉发簪',
                ),
            2082302 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2082303 =>
                array (
                    'name' => '白玉项链',
                ),
            2082304 =>
                array (
                    'name' => '白玉手镯',
                ),
            2082305 =>
                array (
                    'name' => '白玉戒指',
                ),
            2082306 =>
                array (
                    'name' => '白玉护符',
                ),
            2082311 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2082312 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2082313 =>
                array (
                    'name' => '飞仙项链',
                ),
            2082314 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2082315 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2082316 =>
                array (
                    'name' => '飞仙护符',
                ),
            2082321 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2082322 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2082323 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2082324 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2082325 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2082326 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2082331 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2082332 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2082333 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2082334 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2082335 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2082336 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2082341 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2082342 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2082343 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2082344 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2082345 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2082346 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2082351 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2082352 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2082353 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2082354 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2082355 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2082356 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2082361 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2082362 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2082363 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2082364 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2082365 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2082366 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2082401 =>
                array (
                    'name' => '白玉发簪',
                ),
            2082402 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2082403 =>
                array (
                    'name' => '白玉项链',
                ),
            2082404 =>
                array (
                    'name' => '白玉手镯',
                ),
            2082405 =>
                array (
                    'name' => '白玉戒指',
                ),
            2082406 =>
                array (
                    'name' => '白玉护符',
                ),
            2082411 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2082412 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2082413 =>
                array (
                    'name' => '飞仙项链',
                ),
            2082414 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2082415 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2082416 =>
                array (
                    'name' => '飞仙护符',
                ),
            2082421 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2082422 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2082423 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2082424 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2082425 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2082426 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2082431 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2082432 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2082433 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2082434 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2082435 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2082436 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2082441 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2082442 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2082443 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2082444 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2082445 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2082446 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2082451 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2082452 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2082453 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2082454 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2082455 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2082456 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2082461 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2082462 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2082463 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2082464 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2082465 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2082466 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2082501 =>
                array (
                    'name' => '白玉发簪',
                ),
            2082502 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2082503 =>
                array (
                    'name' => '白玉项链',
                ),
            2082504 =>
                array (
                    'name' => '白玉手镯',
                ),
            2082505 =>
                array (
                    'name' => '白玉戒指',
                ),
            2082506 =>
                array (
                    'name' => '白玉护符',
                ),
            2082511 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2082512 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2082513 =>
                array (
                    'name' => '飞仙项链',
                ),
            2082514 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2082515 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2082516 =>
                array (
                    'name' => '飞仙护符',
                ),
            2082521 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2082522 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2082523 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2082524 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2082525 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2082526 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2082531 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2082532 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2082533 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2082534 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2082535 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2082536 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2082541 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2082542 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2082543 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2082544 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2082545 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2082546 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2082551 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2082552 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2082553 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2082554 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2082555 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2082556 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2082561 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2082562 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2082563 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2082564 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2082565 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2082566 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2082601 =>
                array (
                    'name' => '白玉发簪',
                ),
            2082602 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2082603 =>
                array (
                    'name' => '白玉项链',
                ),
            2082604 =>
                array (
                    'name' => '白玉手镯',
                ),
            2082605 =>
                array (
                    'name' => '白玉戒指',
                ),
            2082606 =>
                array (
                    'name' => '白玉护符',
                ),
            2082611 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2082612 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2082613 =>
                array (
                    'name' => '飞仙项链',
                ),
            2082614 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2082615 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2082616 =>
                array (
                    'name' => '飞仙护符',
                ),
            2082621 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2082622 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2082623 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2082624 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2082625 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2082626 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2082631 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2082632 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2082633 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2082634 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2082635 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2082636 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2082641 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2082642 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2082643 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2082644 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2082645 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2082646 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2082651 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2082652 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2082653 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2082654 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2082655 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2082656 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2082661 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2082662 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2082663 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2082664 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2082665 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2082666 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2082701 =>
                array (
                    'name' => '白玉发簪',
                ),
            2082702 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2082703 =>
                array (
                    'name' => '白玉项链',
                ),
            2082704 =>
                array (
                    'name' => '白玉手镯',
                ),
            2082705 =>
                array (
                    'name' => '白玉戒指',
                ),
            2082706 =>
                array (
                    'name' => '白玉护符',
                ),
            2082711 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2082712 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2082713 =>
                array (
                    'name' => '飞仙项链',
                ),
            2082714 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2082715 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2082716 =>
                array (
                    'name' => '飞仙护符',
                ),
            2082721 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2082722 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2082723 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2082724 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2082725 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2082726 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2082731 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2082732 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2082733 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2082734 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2082735 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2082736 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2082741 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2082742 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2082743 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2082744 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2082745 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2082746 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2082751 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2082752 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2082753 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2082754 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2082755 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2082756 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2082761 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2082762 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2082763 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2082764 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2082765 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2082766 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2082801 =>
                array (
                    'name' => '白玉发簪',
                ),
            2082802 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2082803 =>
                array (
                    'name' => '白玉项链',
                ),
            2082804 =>
                array (
                    'name' => '白玉手镯',
                ),
            2082805 =>
                array (
                    'name' => '白玉戒指',
                ),
            2082806 =>
                array (
                    'name' => '白玉护符',
                ),
            2082811 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2082812 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2082813 =>
                array (
                    'name' => '飞仙项链',
                ),
            2082814 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2082815 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2082816 =>
                array (
                    'name' => '飞仙护符',
                ),
            2082821 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2082822 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2082823 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2082824 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2082825 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2082826 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2082831 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2082832 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2082833 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2082834 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2082835 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2082836 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2082841 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2082842 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2082843 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2082844 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2082845 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2082846 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2082851 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2082852 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2082853 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2082854 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2082855 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2082856 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2082861 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2082862 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2082863 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2082864 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2082865 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2082866 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2082901 =>
                array (
                    'name' => '白玉发簪',
                ),
            2082902 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2082903 =>
                array (
                    'name' => '白玉项链',
                ),
            2082904 =>
                array (
                    'name' => '白玉手镯',
                ),
            2082905 =>
                array (
                    'name' => '白玉戒指',
                ),
            2082906 =>
                array (
                    'name' => '白玉护符',
                ),
            2082911 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2082912 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2082913 =>
                array (
                    'name' => '飞仙项链',
                ),
            2082914 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2082915 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2082916 =>
                array (
                    'name' => '飞仙护符',
                ),
            2082921 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2082922 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2082923 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2082924 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2082925 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2082926 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2082931 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2082932 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2082933 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2082934 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2082935 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2082936 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2082941 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2082942 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2082943 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2082944 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2082945 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2082946 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2082951 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2082952 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2082953 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2082954 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2082955 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2082956 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2082961 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2082962 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2082963 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2082964 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2082965 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2082966 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2083001 =>
                array (
                    'name' => '白玉发簪',
                ),
            2083002 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2083003 =>
                array (
                    'name' => '白玉项链',
                ),
            2083004 =>
                array (
                    'name' => '白玉手镯',
                ),
            2083005 =>
                array (
                    'name' => '白玉戒指',
                ),
            2083006 =>
                array (
                    'name' => '白玉护符',
                ),
            2083011 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2083012 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2083013 =>
                array (
                    'name' => '飞仙项链',
                ),
            2083014 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2083015 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2083016 =>
                array (
                    'name' => '飞仙护符',
                ),
            2083021 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2083022 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2083023 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2083024 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2083025 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2083026 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2083031 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2083032 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2083033 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2083034 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2083035 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2083036 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2083041 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2083042 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2083043 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2083044 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2083045 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2083046 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2083051 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2083052 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2083053 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2083054 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2083055 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2083056 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2083061 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2083062 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2083063 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2083064 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2083065 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2083066 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2083101 =>
                array (
                    'name' => '白玉发簪',
                ),
            2083102 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2083103 =>
                array (
                    'name' => '白玉项链',
                ),
            2083104 =>
                array (
                    'name' => '白玉手镯',
                ),
            2083105 =>
                array (
                    'name' => '白玉戒指',
                ),
            2083106 =>
                array (
                    'name' => '白玉护符',
                ),
            2083111 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2083112 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2083113 =>
                array (
                    'name' => '飞仙项链',
                ),
            2083114 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2083115 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2083116 =>
                array (
                    'name' => '飞仙护符',
                ),
            2083121 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2083122 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2083123 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2083124 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2083125 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2083126 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2083131 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2083132 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2083133 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2083134 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2083135 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2083136 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2083141 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2083142 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2083143 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2083144 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2083145 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2083146 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2083151 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2083152 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2083153 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2083154 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2083155 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2083156 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2083161 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2083162 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2083163 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2083164 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2083165 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2083166 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2083201 =>
                array (
                    'name' => '白玉发簪',
                ),
            2083202 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2083203 =>
                array (
                    'name' => '白玉项链',
                ),
            2083204 =>
                array (
                    'name' => '白玉手镯',
                ),
            2083205 =>
                array (
                    'name' => '白玉戒指',
                ),
            2083206 =>
                array (
                    'name' => '白玉护符',
                ),
            2083211 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2083212 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2083213 =>
                array (
                    'name' => '飞仙项链',
                ),
            2083214 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2083215 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2083216 =>
                array (
                    'name' => '飞仙护符',
                ),
            2083221 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2083222 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2083223 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2083224 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2083225 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2083226 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2083231 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2083232 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2083233 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2083234 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2083235 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2083236 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2083241 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2083242 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2083243 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2083244 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2083245 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2083246 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2083251 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2083252 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2083253 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2083254 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2083255 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2083256 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2083261 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2083262 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2083263 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2083264 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2083265 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2083266 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2083301 =>
                array (
                    'name' => '白玉发簪',
                ),
            2083302 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2083303 =>
                array (
                    'name' => '白玉项链',
                ),
            2083304 =>
                array (
                    'name' => '白玉手镯',
                ),
            2083305 =>
                array (
                    'name' => '白玉戒指',
                ),
            2083306 =>
                array (
                    'name' => '白玉护符',
                ),
            2083311 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2083312 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2083313 =>
                array (
                    'name' => '飞仙项链',
                ),
            2083314 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2083315 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2083316 =>
                array (
                    'name' => '飞仙护符',
                ),
            2083321 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2083322 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2083323 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2083324 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2083325 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2083326 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2083331 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2083332 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2083333 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2083334 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2083335 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2083336 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2083341 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2083342 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2083343 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2083344 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2083345 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2083346 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2083351 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2083352 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2083353 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2083354 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2083355 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2083356 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2083361 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2083362 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2083363 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2083364 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2083365 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2083366 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2083401 =>
                array (
                    'name' => '白玉发簪',
                ),
            2083402 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2083403 =>
                array (
                    'name' => '白玉项链',
                ),
            2083404 =>
                array (
                    'name' => '白玉手镯',
                ),
            2083405 =>
                array (
                    'name' => '白玉戒指',
                ),
            2083406 =>
                array (
                    'name' => '白玉护符',
                ),
            2083411 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2083412 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2083413 =>
                array (
                    'name' => '飞仙项链',
                ),
            2083414 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2083415 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2083416 =>
                array (
                    'name' => '飞仙护符',
                ),
            2083421 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2083422 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2083423 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2083424 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2083425 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2083426 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2083431 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2083432 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2083433 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2083434 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2083435 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2083436 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2083441 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2083442 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2083443 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2083444 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2083445 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2083446 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2083451 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2083452 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2083453 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2083454 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2083455 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2083456 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2083461 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2083462 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2083463 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2083464 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2083465 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2083466 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2083501 =>
                array (
                    'name' => '白玉发簪',
                ),
            2083502 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2083503 =>
                array (
                    'name' => '白玉项链',
                ),
            2083504 =>
                array (
                    'name' => '白玉手镯',
                ),
            2083505 =>
                array (
                    'name' => '白玉戒指',
                ),
            2083506 =>
                array (
                    'name' => '白玉护符',
                ),
            2083511 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2083512 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2083513 =>
                array (
                    'name' => '飞仙项链',
                ),
            2083514 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2083515 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2083516 =>
                array (
                    'name' => '飞仙护符',
                ),
            2083521 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2083522 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2083523 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2083524 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2083525 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2083526 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2083531 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2083532 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2083533 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2083534 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2083535 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2083536 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2083541 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2083542 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2083543 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2083544 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2083545 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2083546 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2083551 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2083552 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2083553 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2083554 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2083555 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2083556 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2083561 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2083562 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2083563 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2083564 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2083565 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2083566 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2083601 =>
                array (
                    'name' => '白玉发簪',
                ),
            2083602 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2083603 =>
                array (
                    'name' => '白玉项链',
                ),
            2083604 =>
                array (
                    'name' => '白玉手镯',
                ),
            2083605 =>
                array (
                    'name' => '白玉戒指',
                ),
            2083606 =>
                array (
                    'name' => '白玉护符',
                ),
            2083611 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2083612 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2083613 =>
                array (
                    'name' => '飞仙项链',
                ),
            2083614 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2083615 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2083616 =>
                array (
                    'name' => '飞仙护符',
                ),
            2083621 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2083622 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2083623 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2083624 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2083625 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2083626 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2083631 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2083632 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2083633 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2083634 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2083635 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2083636 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2083641 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2083642 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2083643 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2083644 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2083645 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2083646 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2083651 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2083652 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2083653 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2083654 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2083655 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2083656 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2083661 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2083662 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2083663 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2083664 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2083665 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2083666 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2083701 =>
                array (
                    'name' => '白玉发簪',
                ),
            2083702 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2083703 =>
                array (
                    'name' => '白玉项链',
                ),
            2083704 =>
                array (
                    'name' => '白玉手镯',
                ),
            2083705 =>
                array (
                    'name' => '白玉戒指',
                ),
            2083706 =>
                array (
                    'name' => '白玉护符',
                ),
            2083711 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2083712 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2083713 =>
                array (
                    'name' => '飞仙项链',
                ),
            2083714 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2083715 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2083716 =>
                array (
                    'name' => '飞仙护符',
                ),
            2083721 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2083722 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2083723 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2083724 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2083725 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2083726 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2083731 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2083732 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2083733 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2083734 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2083735 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2083736 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2083741 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2083742 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2083743 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2083744 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2083745 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2083746 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2083751 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2083752 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2083753 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2083754 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2083755 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2083756 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2083761 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2083762 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2083763 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2083764 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2083765 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2083766 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2083801 =>
                array (
                    'name' => '白玉发簪',
                ),
            2083802 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2083803 =>
                array (
                    'name' => '白玉项链',
                ),
            2083804 =>
                array (
                    'name' => '白玉手镯',
                ),
            2083805 =>
                array (
                    'name' => '白玉戒指',
                ),
            2083806 =>
                array (
                    'name' => '白玉护符',
                ),
            2083811 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2083812 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2083813 =>
                array (
                    'name' => '飞仙项链',
                ),
            2083814 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2083815 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2083816 =>
                array (
                    'name' => '飞仙护符',
                ),
            2083821 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2083822 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2083823 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2083824 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2083825 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2083826 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2083831 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2083832 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2083833 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2083834 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2083835 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2083836 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2083841 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2083842 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2083843 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2083844 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2083845 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2083846 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2083851 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2083852 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2083853 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2083854 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2083855 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2083856 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2083861 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2083862 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2083863 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2083864 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2083865 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2083866 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2083901 =>
                array (
                    'name' => '白玉发簪',
                ),
            2083902 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2083903 =>
                array (
                    'name' => '白玉项链',
                ),
            2083904 =>
                array (
                    'name' => '白玉手镯',
                ),
            2083905 =>
                array (
                    'name' => '白玉戒指',
                ),
            2083906 =>
                array (
                    'name' => '白玉护符',
                ),
            2083911 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2083912 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2083913 =>
                array (
                    'name' => '飞仙项链',
                ),
            2083914 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2083915 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2083916 =>
                array (
                    'name' => '飞仙护符',
                ),
            2083921 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2083922 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2083923 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2083924 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2083925 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2083926 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2083931 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2083932 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2083933 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2083934 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2083935 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2083936 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2083941 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2083942 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2083943 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2083944 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2083945 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2083946 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2083951 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2083952 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2083953 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2083954 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2083955 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2083956 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2083961 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2083962 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2083963 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2083964 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2083965 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2083966 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2084001 =>
                array (
                    'name' => '白玉发簪',
                ),
            2084002 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2084003 =>
                array (
                    'name' => '白玉项链',
                ),
            2084004 =>
                array (
                    'name' => '白玉手镯',
                ),
            2084005 =>
                array (
                    'name' => '白玉戒指',
                ),
            2084006 =>
                array (
                    'name' => '白玉护符',
                ),
            2084011 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2084012 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2084013 =>
                array (
                    'name' => '飞仙项链',
                ),
            2084014 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2084015 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2084016 =>
                array (
                    'name' => '飞仙护符',
                ),
            2084021 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2084022 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2084023 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2084024 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2084025 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2084026 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2084031 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2084032 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2084033 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2084034 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2084035 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2084036 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2084041 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2084042 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2084043 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2084044 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2084045 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2084046 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2084051 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2084052 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2084053 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2084054 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2084055 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2084056 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2084061 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2084062 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2084063 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2084064 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2084065 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2084066 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2084101 =>
                array (
                    'name' => '白玉发簪',
                ),
            2084102 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2084103 =>
                array (
                    'name' => '白玉项链',
                ),
            2084104 =>
                array (
                    'name' => '白玉手镯',
                ),
            2084105 =>
                array (
                    'name' => '白玉戒指',
                ),
            2084106 =>
                array (
                    'name' => '白玉护符',
                ),
            2084111 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2084112 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2084113 =>
                array (
                    'name' => '飞仙项链',
                ),
            2084114 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2084115 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2084116 =>
                array (
                    'name' => '飞仙护符',
                ),
            2084121 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2084122 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2084123 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2084124 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2084125 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2084126 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2084131 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2084132 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2084133 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2084134 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2084135 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2084136 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2084141 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2084142 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2084143 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2084144 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2084145 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2084146 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2084151 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2084152 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2084153 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2084154 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2084155 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2084156 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2084161 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2084162 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2084163 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2084164 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2084165 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2084166 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2084201 =>
                array (
                    'name' => '白玉发簪',
                ),
            2084202 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2084203 =>
                array (
                    'name' => '白玉项链',
                ),
            2084204 =>
                array (
                    'name' => '白玉手镯',
                ),
            2084205 =>
                array (
                    'name' => '白玉戒指',
                ),
            2084206 =>
                array (
                    'name' => '白玉护符',
                ),
            2084211 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2084212 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2084213 =>
                array (
                    'name' => '飞仙项链',
                ),
            2084214 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2084215 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2084216 =>
                array (
                    'name' => '飞仙护符',
                ),
            2084221 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2084222 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2084223 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2084224 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2084225 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2084226 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2084231 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2084232 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2084233 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2084234 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2084235 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2084236 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2084241 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2084242 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2084243 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2084244 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2084245 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2084246 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2084251 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2084252 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2084253 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2084254 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2084255 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2084256 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2084261 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2084262 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2084263 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2084264 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2084265 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2084266 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2084301 =>
                array (
                    'name' => '白玉发簪',
                ),
            2084302 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2084303 =>
                array (
                    'name' => '白玉项链',
                ),
            2084304 =>
                array (
                    'name' => '白玉手镯',
                ),
            2084305 =>
                array (
                    'name' => '白玉戒指',
                ),
            2084306 =>
                array (
                    'name' => '白玉护符',
                ),
            2084311 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2084312 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2084313 =>
                array (
                    'name' => '飞仙项链',
                ),
            2084314 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2084315 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2084316 =>
                array (
                    'name' => '飞仙护符',
                ),
            2084321 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2084322 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2084323 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2084324 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2084325 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2084326 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2084331 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2084332 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2084333 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2084334 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2084335 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2084336 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2084341 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2084342 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2084343 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2084344 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2084345 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2084346 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2084351 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2084352 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2084353 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2084354 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2084355 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2084356 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2084361 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2084362 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2084363 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2084364 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2084365 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2084366 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2084401 =>
                array (
                    'name' => '白玉发簪',
                ),
            2084402 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2084403 =>
                array (
                    'name' => '白玉项链',
                ),
            2084404 =>
                array (
                    'name' => '白玉手镯',
                ),
            2084405 =>
                array (
                    'name' => '白玉戒指',
                ),
            2084406 =>
                array (
                    'name' => '白玉护符',
                ),
            2084411 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2084412 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2084413 =>
                array (
                    'name' => '飞仙项链',
                ),
            2084414 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2084415 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2084416 =>
                array (
                    'name' => '飞仙护符',
                ),
            2084421 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2084422 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2084423 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2084424 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2084425 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2084426 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2084431 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2084432 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2084433 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2084434 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2084435 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2084436 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2084441 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2084442 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2084443 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2084444 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2084445 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2084446 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2084451 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2084452 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2084453 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2084454 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2084455 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2084456 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2084461 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2084462 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2084463 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2084464 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2084465 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2084466 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2084501 =>
                array (
                    'name' => '白玉发簪',
                ),
            2084502 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2084503 =>
                array (
                    'name' => '白玉项链',
                ),
            2084504 =>
                array (
                    'name' => '白玉手镯',
                ),
            2084505 =>
                array (
                    'name' => '白玉戒指',
                ),
            2084506 =>
                array (
                    'name' => '白玉护符',
                ),
            2084511 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2084512 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2084513 =>
                array (
                    'name' => '飞仙项链',
                ),
            2084514 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2084515 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2084516 =>
                array (
                    'name' => '飞仙护符',
                ),
            2084521 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2084522 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2084523 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2084524 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2084525 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2084526 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2084531 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2084532 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2084533 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2084534 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2084535 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2084536 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2084541 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2084542 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2084543 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2084544 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2084545 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2084546 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2084551 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2084552 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2084553 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2084554 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2084555 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2084556 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2084561 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2084562 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2084563 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2084564 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2084565 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2084566 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2084601 =>
                array (
                    'name' => '白玉发簪',
                ),
            2084602 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2084603 =>
                array (
                    'name' => '白玉项链',
                ),
            2084604 =>
                array (
                    'name' => '白玉手镯',
                ),
            2084605 =>
                array (
                    'name' => '白玉戒指',
                ),
            2084606 =>
                array (
                    'name' => '白玉护符',
                ),
            2084611 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2084612 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2084613 =>
                array (
                    'name' => '飞仙项链',
                ),
            2084614 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2084615 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2084616 =>
                array (
                    'name' => '飞仙护符',
                ),
            2084621 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2084622 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2084623 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2084624 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2084625 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2084626 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2084631 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2084632 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2084633 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2084634 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2084635 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2084636 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2084641 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2084642 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2084643 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2084644 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2084645 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2084646 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2084651 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2084652 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2084653 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2084654 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2084655 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2084656 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2084661 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2084662 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2084663 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2084664 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2084665 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2084666 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2084701 =>
                array (
                    'name' => '白玉发簪',
                ),
            2084702 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2084703 =>
                array (
                    'name' => '白玉项链',
                ),
            2084704 =>
                array (
                    'name' => '白玉手镯',
                ),
            2084705 =>
                array (
                    'name' => '白玉戒指',
                ),
            2084706 =>
                array (
                    'name' => '白玉护符',
                ),
            2084711 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2084712 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2084713 =>
                array (
                    'name' => '飞仙项链',
                ),
            2084714 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2084715 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2084716 =>
                array (
                    'name' => '飞仙护符',
                ),
            2084721 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2084722 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2084723 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2084724 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2084725 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2084726 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2084731 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2084732 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2084733 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2084734 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2084735 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2084736 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2084741 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2084742 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2084743 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2084744 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2084745 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2084746 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2084751 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2084752 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2084753 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2084754 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2084755 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2084756 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2084761 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2084762 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2084763 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2084764 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2084765 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2084766 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2084801 =>
                array (
                    'name' => '白玉发簪',
                ),
            2084802 =>
                array (
                    'name' => '白玉耳坠',
                ),
            2084803 =>
                array (
                    'name' => '白玉项链',
                ),
            2084804 =>
                array (
                    'name' => '白玉手镯',
                ),
            2084805 =>
                array (
                    'name' => '白玉戒指',
                ),
            2084806 =>
                array (
                    'name' => '白玉护符',
                ),
            2084811 =>
                array (
                    'name' => '飞仙发簪',
                ),
            2084812 =>
                array (
                    'name' => '飞仙耳坠',
                ),
            2084813 =>
                array (
                    'name' => '飞仙项链',
                ),
            2084814 =>
                array (
                    'name' => '飞仙手镯',
                ),
            2084815 =>
                array (
                    'name' => '飞仙戒指',
                ),
            2084816 =>
                array (
                    'name' => '飞仙护符',
                ),
            2084821 =>
                array (
                    'name' => '苍鸾发簪',
                ),
            2084822 =>
                array (
                    'name' => '苍鸾耳坠',
                ),
            2084823 =>
                array (
                    'name' => '苍鸾项链',
                ),
            2084824 =>
                array (
                    'name' => '苍鸾手镯',
                ),
            2084825 =>
                array (
                    'name' => '苍鸾戒指',
                ),
            2084826 =>
                array (
                    'name' => '苍鸾护符',
                ),
            2084831 =>
                array (
                    'name' => '紫骊夺光发簪',
                ),
            2084832 =>
                array (
                    'name' => '紫骊夺光耳坠',
                ),
            2084833 =>
                array (
                    'name' => '紫骊夺光项链',
                ),
            2084834 =>
                array (
                    'name' => '紫骊夺光手镯',
                ),
            2084835 =>
                array (
                    'name' => '紫骊夺光戒指',
                ),
            2084836 =>
                array (
                    'name' => '紫骊夺光护符',
                ),
            2084841 =>
                array (
                    'name' => '大夏龙雀发簪',
                ),
            2084842 =>
                array (
                    'name' => '大夏龙雀耳坠',
                ),
            2084843 =>
                array (
                    'name' => '大夏龙雀项链',
                ),
            2084844 =>
                array (
                    'name' => '大夏龙雀手镯',
                ),
            2084845 =>
                array (
                    'name' => '大夏龙雀戒指',
                ),
            2084846 =>
                array (
                    'name' => '大夏龙雀护符',
                ),
            2084851 =>
                array (
                    'name' => '腾霄幻日发簪',
                ),
            2084852 =>
                array (
                    'name' => '腾霄幻日耳坠',
                ),
            2084853 =>
                array (
                    'name' => '腾霄幻日项链',
                ),
            2084854 =>
                array (
                    'name' => '腾霄幻日手镯',
                ),
            2084855 =>
                array (
                    'name' => '腾霄幻日戒指',
                ),
            2084856 =>
                array (
                    'name' => '腾霄幻日护符',
                ),
            2084861 =>
                array (
                    'name' => '九天枫华发簪',
                ),
            2084862 =>
                array (
                    'name' => '九天枫华耳坠',
                ),
            2084863 =>
                array (
                    'name' => '九天枫华项链',
                ),
            2084864 =>
                array (
                    'name' => '九天枫华手镯',
                ),
            2084865 =>
                array (
                    'name' => '九天枫华戒指',
                ),
            2084866 =>
                array (
                    'name' => '九天枫华护符',
                ),
            2091001 =>
                array (
                    'name' => '1级红宝石',
                ),
            2091002 =>
                array (
                    'name' => '1级橙宝石',
                ),
            2091003 =>
                array (
                    'name' => '1级黄宝石',
                ),
            2091004 =>
                array (
                    'name' => '1级绿宝石',
                ),
            2091005 =>
                array (
                    'name' => '1级青宝石',
                ),
            2091006 =>
                array (
                    'name' => '1级蓝宝石',
                ),
            2091007 =>
                array (
                    'name' => '1级紫宝石',
                ),
            2091011 =>
                array (
                    'name' => '2级红宝石',
                ),
            2091012 =>
                array (
                    'name' => '2级橙宝石',
                ),
            2091013 =>
                array (
                    'name' => '2级黄宝石',
                ),
            2091014 =>
                array (
                    'name' => '2级绿宝石',
                ),
            2091015 =>
                array (
                    'name' => '2级青宝石',
                ),
            2091016 =>
                array (
                    'name' => '2级蓝宝石',
                ),
            2091017 =>
                array (
                    'name' => '2级紫宝石',
                ),
            2091021 =>
                array (
                    'name' => '3级红宝石',
                ),
            2091022 =>
                array (
                    'name' => '3级橙宝石',
                ),
            2091023 =>
                array (
                    'name' => '3级黄宝石',
                ),
            2091024 =>
                array (
                    'name' => '3级绿宝石',
                ),
            2091025 =>
                array (
                    'name' => '3级青宝石',
                ),
            2091026 =>
                array (
                    'name' => '3级蓝宝石',
                ),
            2091027 =>
                array (
                    'name' => '3级紫宝石',
                ),
            2091031 =>
                array (
                    'name' => '4级红宝石',
                ),
            2091032 =>
                array (
                    'name' => '4级橙宝石',
                ),
            2091033 =>
                array (
                    'name' => '4级黄宝石',
                ),
            2091034 =>
                array (
                    'name' => '4级绿宝石',
                ),
            2091035 =>
                array (
                    'name' => '4级青宝石',
                ),
            2091036 =>
                array (
                    'name' => '4级蓝宝石',
                ),
            2091037 =>
                array (
                    'name' => '4级紫宝石',
                ),
            2091041 =>
                array (
                    'name' => '5级红宝石',
                ),
            2091042 =>
                array (
                    'name' => '5级橙宝石',
                ),
            2091043 =>
                array (
                    'name' => '5级黄宝石',
                ),
            2091044 =>
                array (
                    'name' => '5级绿宝石',
                ),
            2091045 =>
                array (
                    'name' => '5级青宝石',
                ),
            2091046 =>
                array (
                    'name' => '5级蓝宝石',
                ),
            2091047 =>
                array (
                    'name' => '5级紫宝石',
                ),
            2091051 =>
                array (
                    'name' => '6级红宝石',
                ),
            2091052 =>
                array (
                    'name' => '6级橙宝石',
                ),
            2091053 =>
                array (
                    'name' => '6级黄宝石',
                ),
            2091054 =>
                array (
                    'name' => '6级绿宝石',
                ),
            2091055 =>
                array (
                    'name' => '6级青宝石',
                ),
            2091056 =>
                array (
                    'name' => '6级蓝宝石',
                ),
            2091057 =>
                array (
                    'name' => '6级紫宝石',
                ),
            2091061 =>
                array (
                    'name' => '7级红宝石',
                ),
            2091062 =>
                array (
                    'name' => '7级橙宝石',
                ),
            2091063 =>
                array (
                    'name' => '7级黄宝石',
                ),
            2091064 =>
                array (
                    'name' => '7级绿宝石',
                ),
            2091065 =>
                array (
                    'name' => '7级青宝石',
                ),
            2091066 =>
                array (
                    'name' => '7级蓝宝石',
                ),
            2091067 =>
                array (
                    'name' => '7级紫宝石',
                ),
            2091071 =>
                array (
                    'name' => '8级红宝石',
                ),
            2091072 =>
                array (
                    'name' => '8级橙宝石',
                ),
            2091073 =>
                array (
                    'name' => '8级黄宝石',
                ),
            2091074 =>
                array (
                    'name' => '8级绿宝石',
                ),
            2091075 =>
                array (
                    'name' => '8级青宝石',
                ),
            2091076 =>
                array (
                    'name' => '8级蓝宝石',
                ),
            2091077 =>
                array (
                    'name' => '8级紫宝石',
                ),
            2091081 =>
                array (
                    'name' => '9级红宝石',
                ),
            2091082 =>
                array (
                    'name' => '9级橙宝石',
                ),
            2091083 =>
                array (
                    'name' => '9级黄宝石',
                ),
            2091084 =>
                array (
                    'name' => '9级绿宝石',
                ),
            2091085 =>
                array (
                    'name' => '9级青宝石',
                ),
            2091086 =>
                array (
                    'name' => '9级蓝宝石',
                ),
            2091087 =>
                array (
                    'name' => '9级紫宝石',
                ),
            2091091 =>
                array (
                    'name' => '10级红宝石',
                ),
            2091092 =>
                array (
                    'name' => '10级橙宝石',
                ),
            2091093 =>
                array (
                    'name' => '10级黄宝石',
                ),
            2091094 =>
                array (
                    'name' => '10级绿宝石',
                ),
            2091095 =>
                array (
                    'name' => '10级青宝石',
                ),
            2091096 =>
                array (
                    'name' => '10级蓝宝石',
                ),
            2091097 =>
                array (
                    'name' => '10级紫宝石',
                ),
            2101001 =>
                array (
                    'name' => '锐金',
                ),
            2101002 =>
                array (
                    'name' => '寒冰',
                ),
            2101003 =>
                array (
                    'name' => '疾风',
                ),
            2101004 =>
                array (
                    'name' => '血狂',
                ),
            2101005 =>
                array (
                    'name' => '惊影',
                ),
            2101006 =>
                array (
                    'name' => '无回',
                ),
            2101007 =>
                array (
                    'name' => '无缺',
                ),
            2101008 =>
                array (
                    'name' => '山岳',
                ),
            2102001 =>
                array (
                    'name' => '杀戮',
                ),
            2102002 =>
                array (
                    'name' => '无生',
                ),
            2102003 =>
                array (
                    'name' => '枯荣',
                ),
            2102004 =>
                array (
                    'name' => '真罡',
                ),
            2102005 =>
                array (
                    'name' => '无相',
                ),
            2102006 =>
                array (
                    'name' => '极限',
                ),
            2102007 =>
                array (
                    'name' => '真空',
                ),
            2102008 =>
                array (
                    'name' => '修罗',
                ),
            2103001 =>
                array (
                    'name' => '皇极',
                ),
            2103002 =>
                array (
                    'name' => '无尽',
                ),
            2103003 =>
                array (
                    'name' => '万象',
                ),
            2103004 =>
                array (
                    'name' => '真阳',
                ),
            2103005 =>
                array (
                    'name' => '封天',
                ),
            2103006 =>
                array (
                    'name' => '通天',
                ),
            2103007 =>
                array (
                    'name' => '绝地',
                ),
            2103008 =>
                array (
                    'name' => '覆海',
                ),
            2104001 =>
                array (
                    'name' => '死亡',
                ),
            2104002 =>
                array (
                    'name' => '生命',
                ),
            2104003 =>
                array (
                    'name' => '毁灭',
                ),
            2104004 =>
                array (
                    'name' => '轮回',
                ),
            2111001 =>
                array (
                    'name' => '异火1',
                ),
            2111002 =>
                array (
                    'name' => '异火2',
                ),
            2111003 =>
                array (
                    'name' => '异火3',
                ),
            2111004 =>
                array (
                    'name' => '异火4',
                ),
            2111005 =>
                array (
                    'name' => '异火5',
                ),
            2111006 =>
                array (
                    'name' => '异火6',
                ),
            2111007 =>
                array (
                    'name' => '异火7',
                ),
            2111008 =>
                array (
                    'name' => '异火8',
                ),
            2111009 =>
                array (
                    'name' => '异火9',
                ),
            2111010 =>
                array (
                    'name' => '异火10',
                ),
            2121001 =>
                array (
                    'name' => '天鼎1',
                ),
            2121002 =>
                array (
                    'name' => '天鼎2',
                ),
            2121003 =>
                array (
                    'name' => '天鼎3',
                ),
            2121004 =>
                array (
                    'name' => '天鼎4',
                ),
            2121005 =>
                array (
                    'name' => '天鼎5',
                ),
            2121006 =>
                array (
                    'name' => '天鼎6',
                ),
            2121007 =>
                array (
                    'name' => '天鼎7',
                ),
            2121008 =>
                array (
                    'name' => '天鼎8',
                ),
            2121009 =>
                array (
                    'name' => '天鼎9',
                ),
            2121010 =>
                array (
                    'name' => '天鼎10',
                ),
            2141001 =>
                array (
                    'name' => '丹方·下品生命丹',
                ),
            2141002 =>
                array (
                    'name' => '丹方·下品攻击丹',
                ),
            2141003 =>
                array (
                    'name' => '丹方·下品防御丹',
                ),
            2141011 =>
                array (
                    'name' => '丹方·中品生命丹',
                ),
            2141012 =>
                array (
                    'name' => '丹方·中品攻击丹',
                ),
            2141013 =>
                array (
                    'name' => '丹方·中品防御丹',
                ),
            2141021 =>
                array (
                    'name' => '丹方·上品生命丹',
                ),
            2141022 =>
                array (
                    'name' => '丹方·上品攻击丹',
                ),
            2141023 =>
                array (
                    'name' => '丹方·上品防御丹',
                ),
            2141031 =>
                array (
                    'name' => '丹方·极品生命丹',
                ),
            2141032 =>
                array (
                    'name' => '丹方·极品攻击丹',
                ),
            2141033 =>
                array (
                    'name' => '丹方·极品防御丹',
                ),
            2141041 =>
                array (
                    'name' => '丹方·王品生命丹',
                ),
            2141042 =>
                array (
                    'name' => '丹方·王品攻击丹',
                ),
            2141043 =>
                array (
                    'name' => '丹方·王品防御丹',
                ),
            2141051 =>
                array (
                    'name' => '丹方·皇品生命丹',
                ),
            2141052 =>
                array (
                    'name' => '丹方·皇品攻击丹',
                ),
            2141053 =>
                array (
                    'name' => '丹方·皇品防御丹',
                ),
            2141061 =>
                array (
                    'name' => '丹方·帝品生命丹',
                ),
            2141062 =>
                array (
                    'name' => '丹方·帝品攻击丹',
                ),
            2141063 =>
                array (
                    'name' => '丹方·帝品防御丹',
                ),
            2151001 =>
                array (
                    'name' => '器图·下品生命灵宝',
                ),
            2151002 =>
                array (
                    'name' => '器图·下品攻击灵宝',
                ),
            2151003 =>
                array (
                    'name' => '器图·下品防御灵宝',
                ),
            2151011 =>
                array (
                    'name' => '器图·中品生命灵宝',
                ),
            2151012 =>
                array (
                    'name' => '器图·中品攻击灵宝',
                ),
            2151013 =>
                array (
                    'name' => '器图·中品防御灵宝',
                ),
            2151021 =>
                array (
                    'name' => '器图·上品生命灵宝',
                ),
            2151022 =>
                array (
                    'name' => '器图·上品攻击灵宝',
                ),
            2151023 =>
                array (
                    'name' => '器图·上品防御灵宝',
                ),
            2151031 =>
                array (
                    'name' => '器图·极品生命灵宝',
                ),
            2151032 =>
                array (
                    'name' => '器图·极品攻击灵宝',
                ),
            2151033 =>
                array (
                    'name' => '器图·极品防御灵宝',
                ),
            2151041 =>
                array (
                    'name' => '器图·王品生命灵宝',
                ),
            2151042 =>
                array (
                    'name' => '器图·王品攻击灵宝',
                ),
            2151043 =>
                array (
                    'name' => '器图·王品防御灵宝',
                ),
            2151051 =>
                array (
                    'name' => '器图·皇品生命灵宝',
                ),
            2151052 =>
                array (
                    'name' => '器图·皇品攻击灵宝',
                ),
            2151053 =>
                array (
                    'name' => '器图·皇品防御灵宝',
                ),
            2151061 =>
                array (
                    'name' => '器图·帝品生命灵宝',
                ),
            2151062 =>
                array (
                    'name' => '器图·帝品攻击灵宝',
                ),
            2151063 =>
                array (
                    'name' => '器图·帝品防御灵宝',
                ),
            2161001 =>
                array (
                    'name' => '掩日剑',
                ),
            2161002 =>
                array (
                    'name' => '惊月剑',
                ),
            2161003 =>
                array (
                    'name' => '摘星剑',
                ),
            2161004 =>
                array (
                    'name' => '破辰剑',
                ),
            2162001 =>
                array (
                    'name' => '大矩',
                ),
            2162002 =>
                array (
                    'name' => '煌灭',
                ),
            2162003 =>
                array (
                    'name' => '长目',
                ),
            2162004 =>
                array (
                    'name' => '不嗔',
                ),
            2162005 =>
                array (
                    'name' => '焚寂',
                ),
            2162006 =>
                array (
                    'name' => '彗蚀',
                ),
            2162007 =>
                array (
                    'name' => '绝云',
                ),
            2163001 =>
                array (
                    'name' => '承影',
                ),
            2163002 =>
                array (
                    'name' => '纯钧',
                ),
            2163003 =>
                array (
                    'name' => '鱼肠',
                ),
            2163004 =>
                array (
                    'name' => '莫邪',
                ),
            2163005 =>
                array (
                    'name' => '干将',
                ),
            2163006 =>
                array (
                    'name' => '七星龙渊',
                ),
            2163007 =>
                array (
                    'name' => '泰阿',
                ),
            2163008 =>
                array (
                    'name' => '赤霄',
                ),
            2163009 =>
                array (
                    'name' => '湛卢',
                ),
            2163010 =>
                array (
                    'name' => '轩辕夏禹',
                ),
            2164001 =>
                array (
                    'name' => '两仪灵剑',
                ),
            2164002 =>
                array (
                    'name' => '太阳剑',
                ),
            2164003 =>
                array (
                    'name' => '太阴剑',
                ),
            2164011 =>
                array (
                    'name' => '混沌圣剑',
                ),
            2164012 =>
                array (
                    'name' => '青萍剑',
                ),
            2164013 =>
                array (
                    'name' => '太乙剑',
                ),
            2164014 =>
                array (
                    'name' => '四宝剑',
                ),
            2164021 =>
                array (
                    'name' => '终焉神剑',
                ),
            2164022 =>
                array (
                    'name' => '离殇剑',
                ),
            2164023 =>
                array (
                    'name' => '空冥剑',
                ),
            2164024 =>
                array (
                    'name' => '湮灭剑',
                ),
            2164025 =>
                array (
                    'name' => '永寂剑',
                ),
            2164101 =>
                array (
                    'name' => '乾坤灵剑',
                ),
            2164102 =>
                array (
                    'name' => '大荒剑',
                ),
            2164103 =>
                array (
                    'name' => '囚天剑',
                ),
            2164111 =>
                array (
                    'name' => '苍穹圣剑',
                ),
            2164112 =>
                array (
                    'name' => '火莲剑',
                ),
            2164113 =>
                array (
                    'name' => '龙凰剑',
                ),
            2164114 =>
                array (
                    'name' => '帝焱剑',
                ),
            2164121 =>
                array (
                    'name' => '大主宰神剑',
                ),
            2164122 =>
                array (
                    'name' => '洛神剑',
                ),
            2164123 =>
                array (
                    'name' => '天帝剑',
                ),
            2164124 =>
                array (
                    'name' => '镇魔剑',
                ),
            2164125 =>
                array (
                    'name' => '须弥剑',
                ),
            2164201 =>
                array (
                    'name' => '太虚灵剑',
                ),
            2164202 =>
                array (
                    'name' => '无极剑',
                ),
            2164203 =>
                array (
                    'name' => '森罗剑',
                ),
            2164211 =>
                array (
                    'name' => '诸天圣剑',
                ),
            2164212 =>
                array (
                    'name' => '空痕剑',
                ),
            2164213 =>
                array (
                    'name' => '葬天剑',
                ),
            2164214 =>
                array (
                    'name' => '枯苍剑 ',
                ),
            2164221 =>
                array (
                    'name' => '诛仙神剑',
                ),
            2164222 =>
                array (
                    'name' => '合欢剑',
                ),
            2164223 =>
                array (
                    'name' => '天琊剑',
                ),
            2164224 =>
                array (
                    'name' => '噬魂剑',
                ),
            2164225 =>
                array (
                    'name' => '鬼王剑',
                ),
            9011001 =>
                array (
                    'name' => '两仪灵剑',
                ),
            9010002 =>
                array (
                    'name' => '混沌圣剑',
                ),
            9010003 =>
                array (
                    'name' => '终焉神剑',
                ),
            9011011 =>
                array (
                    'name' => '乾坤灵剑',
                ),
            9011012 =>
                array (
                    'name' => '苍穹圣剑',
                ),
            9011013 =>
                array (
                    'name' => '大主宰神剑',
                ),
            9011021 =>
                array (
                    'name' => '太虚灵剑',
                ),
            9011022 =>
                array (
                    'name' => '诸天圣剑',
                ),
            9011023 =>
                array (
                    'name' => '诛仙神剑',
                ),
            2171001 =>
                array (
                    'name' => '掩日剑碎片',
                ),
            2171002 =>
                array (
                    'name' => '惊月剑碎片',
                ),
            2171003 =>
                array (
                    'name' => '摘星剑碎片',
                ),
            2171004 =>
                array (
                    'name' => '破辰剑碎片',
                ),
            2172001 =>
                array (
                    'name' => '大矩碎片',
                ),
            2172002 =>
                array (
                    'name' => '煌灭碎片',
                ),
            2172003 =>
                array (
                    'name' => '长目碎片',
                ),
            2172004 =>
                array (
                    'name' => '不嗔碎片',
                ),
            2172005 =>
                array (
                    'name' => '焚寂碎片',
                ),
            2172006 =>
                array (
                    'name' => '彗蚀碎片',
                ),
            2172007 =>
                array (
                    'name' => '绝云碎片',
                ),
            2173001 =>
                array (
                    'name' => '承影碎片',
                ),
            2173002 =>
                array (
                    'name' => '纯钧碎片',
                ),
            2173003 =>
                array (
                    'name' => '鱼肠碎片',
                ),
            2173004 =>
                array (
                    'name' => '莫邪碎片',
                ),
            2173005 =>
                array (
                    'name' => '干将碎片',
                ),
            2173006 =>
                array (
                    'name' => '七星龙渊碎片',
                ),
            2173007 =>
                array (
                    'name' => '泰阿碎片',
                ),
            2173008 =>
                array (
                    'name' => '赤霄碎片',
                ),
            2173009 =>
                array (
                    'name' => '湛卢碎片',
                ),
            2173010 =>
                array (
                    'name' => '轩辕夏禹碎片',
                ),
            2174001 =>
                array (
                    'name' => '两仪灵剑碎片',
                ),
            2174002 =>
                array (
                    'name' => '太阳剑碎片',
                ),
            2174003 =>
                array (
                    'name' => '太阴剑碎片',
                ),
            2174011 =>
                array (
                    'name' => '混沌圣剑碎片',
                ),
            2174012 =>
                array (
                    'name' => '青萍剑碎片',
                ),
            2174013 =>
                array (
                    'name' => '太乙剑碎片',
                ),
            2174014 =>
                array (
                    'name' => '四宝剑碎片',
                ),
            2174021 =>
                array (
                    'name' => '终焉神剑碎片',
                ),
            2174022 =>
                array (
                    'name' => '离殇剑碎片',
                ),
            2174023 =>
                array (
                    'name' => '空冥剑碎片',
                ),
            2174024 =>
                array (
                    'name' => '湮灭剑碎片',
                ),
            2174025 =>
                array (
                    'name' => '永寂剑碎片',
                ),
            2174101 =>
                array (
                    'name' => '乾坤灵剑碎片',
                ),
            2174102 =>
                array (
                    'name' => '大荒剑碎片',
                ),
            2174103 =>
                array (
                    'name' => '囚天剑碎片',
                ),
            2174111 =>
                array (
                    'name' => '苍穹圣剑碎片',
                ),
            2174112 =>
                array (
                    'name' => '火莲剑碎片',
                ),
            2174113 =>
                array (
                    'name' => '龙凰剑碎片',
                ),
            2174114 =>
                array (
                    'name' => '帝焱剑碎片',
                ),
            2174121 =>
                array (
                    'name' => '大主宰神剑碎片',
                ),
            2174122 =>
                array (
                    'name' => '洛神剑碎片',
                ),
            2174123 =>
                array (
                    'name' => '天帝剑碎片',
                ),
            2174124 =>
                array (
                    'name' => '镇魔剑碎片',
                ),
            2174125 =>
                array (
                    'name' => '须弥剑碎片',
                ),
            2174201 =>
                array (
                    'name' => '太虚灵剑碎片',
                ),
            2174202 =>
                array (
                    'name' => '无极剑碎片',
                ),
            2174203 =>
                array (
                    'name' => '森罗剑碎片',
                ),
            2174211 =>
                array (
                    'name' => '诸天圣剑碎片',
                ),
            2174212 =>
                array (
                    'name' => '空痕剑碎片',
                ),
            2174213 =>
                array (
                    'name' => '葬天剑碎片',
                ),
            2174214 =>
                array (
                    'name' => '枯苍剑 碎片',
                ),
            2174221 =>
                array (
                    'name' => '诛仙神剑碎片',
                ),
            2174222 =>
                array (
                    'name' => '合欢剑碎片',
                ),
            2174223 =>
                array (
                    'name' => '天琊剑碎片',
                ),
            2174224 =>
                array (
                    'name' => '噬魂剑碎片',
                ),
            2174225 =>
                array (
                    'name' => '鬼王剑碎片',
                ),
            2180101 =>
                array (
                    'name' => '回天',
                ),
            2180102 =>
                array (
                    'name' => '七杀',
                ),
            2180103 =>
                array (
                    'name' => '御守',
                ),
            2180201 =>
                array (
                    'name' => '回天',
                ),
            2180202 =>
                array (
                    'name' => '七杀',
                ),
            2180203 =>
                array (
                    'name' => '御守',
                ),
            2180204 =>
                array (
                    'name' => '心眼',
                ),
            2180205 =>
                array (
                    'name' => '迷踪',
                ),
            2180206 =>
                array (
                    'name' => '狂澜',
                ),
            2180207 =>
                array (
                    'name' => '不屈',
                ),
            2180208 =>
                array (
                    'name' => '破军',
                ),
            2180209 =>
                array (
                    'name' => '止戈',
                ),
            2180301 =>
                array (
                    'name' => '回天',
                ),
            2180302 =>
                array (
                    'name' => '七杀',
                ),
            2180303 =>
                array (
                    'name' => '御守',
                ),
            2180304 =>
                array (
                    'name' => '心眼',
                ),
            2180305 =>
                array (
                    'name' => '迷踪',
                ),
            2180306 =>
                array (
                    'name' => '狂澜',
                ),
            2180307 =>
                array (
                    'name' => '不屈',
                ),
            2180308 =>
                array (
                    'name' => '破军',
                ),
            2180309 =>
                array (
                    'name' => '止戈',
                ),
            2180401 =>
                array (
                    'name' => '回天',
                ),
            2180402 =>
                array (
                    'name' => '七杀',
                ),
            2180403 =>
                array (
                    'name' => '御守',
                ),
            2180404 =>
                array (
                    'name' => '心眼',
                ),
            2180405 =>
                array (
                    'name' => '迷踪',
                ),
            2180406 =>
                array (
                    'name' => '狂澜',
                ),
            2180407 =>
                array (
                    'name' => '不屈',
                ),
            2180408 =>
                array (
                    'name' => '破军',
                ),
            2180409 =>
                array (
                    'name' => '止戈',
                ),
            2180501 =>
                array (
                    'name' => '回天',
                ),
            2180502 =>
                array (
                    'name' => '七杀',
                ),
            2180503 =>
                array (
                    'name' => '御守',
                ),
            2180504 =>
                array (
                    'name' => '心眼',
                ),
            2180505 =>
                array (
                    'name' => '迷踪',
                ),
            2180506 =>
                array (
                    'name' => '狂澜',
                ),
            2180507 =>
                array (
                    'name' => '不屈',
                ),
            2180508 =>
                array (
                    'name' => '破军',
                ),
            2180509 =>
                array (
                    'name' => '止戈',
                ),
            2180510 =>
                array (
                    'name' => '心眼',
                ),
            2180511 =>
                array (
                    'name' => '迷踪',
                ),
            2180512 =>
                array (
                    'name' => '狂澜',
                ),
            2180513 =>
                array (
                    'name' => '不屈',
                ),
            2180514 =>
                array (
                    'name' => '破军',
                ),
            2180515 =>
                array (
                    'name' => '止戈',
                ),
            2180516 =>
                array (
                    'name' => '血涛',
                ),
            2180517 =>
                array (
                    'name' => '金身',
                ),
            2180604 =>
                array (
                    'name' => '回天',
                ),
            2180605 =>
                array (
                    'name' => '七杀',
                ),
            2180606 =>
                array (
                    'name' => '御守',
                ),
            2180607 =>
                array (
                    'name' => '心眼',
                ),
            2180608 =>
                array (
                    'name' => '迷踪',
                ),
            2180609 =>
                array (
                    'name' => '狂澜',
                ),
            2180610 =>
                array (
                    'name' => '不屈',
                ),
            2180611 =>
                array (
                    'name' => '破军',
                ),
            2180612 =>
                array (
                    'name' => '止戈',
                ),
            2180601 =>
                array (
                    'name' => '归真',
                ),
            2180602 =>
                array (
                    'name' => '剑罡',
                ),
            2180603 =>
                array (
                    'name' => '血刃',
                ),
            2180701 =>
                array (
                    'name' => '瞬影',
                ),
            2180702 =>
                array (
                    'name' => '裂变',
                ),
            2180703 =>
                array (
                    'name' => '拙锋',
                ),
            2180704 =>
                array (
                    'name' => '回天',
                ),
            2180705 =>
                array (
                    'name' => '七杀',
                ),
            2180706 =>
                array (
                    'name' => '御守',
                ),
            2180707 =>
                array (
                    'name' => '心眼',
                ),
            2180708 =>
                array (
                    'name' => '迷踪',
                ),
            2180709 =>
                array (
                    'name' => '狂澜',
                ),
            2180710 =>
                array (
                    'name' => '不屈',
                ),
            2180711 =>
                array (
                    'name' => '破军',
                ),
            2180712 =>
                array (
                    'name' => '止戈',
                ),
            2211001 =>
                array (
                    'name' => '掩日剑魂',
                ),
            2211002 =>
                array (
                    'name' => '惊月剑魂',
                ),
            2211003 =>
                array (
                    'name' => '摘星剑魂',
                ),
            2211004 =>
                array (
                    'name' => '破辰剑魂',
                ),
            2212001 =>
                array (
                    'name' => '大矩剑魂',
                ),
            2212002 =>
                array (
                    'name' => '煌灭剑魂',
                ),
            2212003 =>
                array (
                    'name' => '长目剑魂',
                ),
            2212004 =>
                array (
                    'name' => '不嗔剑魂',
                ),
            2212005 =>
                array (
                    'name' => '焚寂剑魂',
                ),
            2212006 =>
                array (
                    'name' => '彗蚀剑魂',
                ),
            2212007 =>
                array (
                    'name' => '绝云剑魂',
                ),
            2213001 =>
                array (
                    'name' => '承影剑魂',
                ),
            2213002 =>
                array (
                    'name' => '纯钧剑魂',
                ),
            2213003 =>
                array (
                    'name' => '鱼肠剑魂',
                ),
            2213004 =>
                array (
                    'name' => '莫邪剑魂',
                ),
            2213005 =>
                array (
                    'name' => '干将剑魂',
                ),
            2213006 =>
                array (
                    'name' => '七星龙渊剑魂',
                ),
            2213007 =>
                array (
                    'name' => '泰阿剑魂',
                ),
            2213008 =>
                array (
                    'name' => '赤霄剑魂',
                ),
            2213009 =>
                array (
                    'name' => '湛卢剑魂',
                ),
            2213010 =>
                array (
                    'name' => '轩辕夏禹剑魂',
                ),
            2214001 =>
                array (
                    'name' => '两仪剑魂',
                ),
            2214002 =>
                array (
                    'name' => '太阳剑魂',
                ),
            2214003 =>
                array (
                    'name' => '太阴剑魂',
                ),
            2214011 =>
                array (
                    'name' => '混沌剑魂',
                ),
            2214012 =>
                array (
                    'name' => '青萍剑魂',
                ),
            2214013 =>
                array (
                    'name' => '太乙剑魂',
                ),
            2214014 =>
                array (
                    'name' => '四宝剑魂',
                ),
            2214021 =>
                array (
                    'name' => '终焉剑魂',
                ),
            2214022 =>
                array (
                    'name' => '离殇剑魂',
                ),
            2214023 =>
                array (
                    'name' => '空冥剑魂',
                ),
            2214024 =>
                array (
                    'name' => '湮灭剑魂',
                ),
            2214025 =>
                array (
                    'name' => '永寂剑魂',
                ),
            2214101 =>
                array (
                    'name' => '乾坤剑魂',
                ),
            2214102 =>
                array (
                    'name' => '大荒剑魂',
                ),
            2214103 =>
                array (
                    'name' => '囚天剑魂',
                ),
            2214111 =>
                array (
                    'name' => '苍穹剑魂',
                ),
            2214112 =>
                array (
                    'name' => '火莲剑魂',
                ),
            2214113 =>
                array (
                    'name' => '龙凰剑魂',
                ),
            2214114 =>
                array (
                    'name' => '帝焱剑魂',
                ),
            2214121 =>
                array (
                    'name' => '大主宰剑魂',
                ),
            2214122 =>
                array (
                    'name' => '洛神剑魂',
                ),
            2214123 =>
                array (
                    'name' => '天帝剑魂',
                ),
            2214124 =>
                array (
                    'name' => '镇魔剑魂',
                ),
            2214125 =>
                array (
                    'name' => '须弥剑魂',
                ),
            2214201 =>
                array (
                    'name' => '太虚剑魂',
                ),
            2214202 =>
                array (
                    'name' => '无极剑魂',
                ),
            2214203 =>
                array (
                    'name' => '森罗剑魂',
                ),
            2214211 =>
                array (
                    'name' => '诸天剑魂',
                ),
            2214212 =>
                array (
                    'name' => '空痕剑魂',
                ),
            2214213 =>
                array (
                    'name' => '葬天剑魂',
                ),
            2214214 =>
                array (
                    'name' => '枯苍 剑魂',
                ),
            2214221 =>
                array (
                    'name' => '诛仙剑魂',
                ),
            2214222 =>
                array (
                    'name' => '合欢剑魂',
                ),
            2214223 =>
                array (
                    'name' => '天琊剑魂',
                ),
            2214224 =>
                array (
                    'name' => '噬魂剑魂',
                ),
            2214225 =>
                array (
                    'name' => '鬼王剑魂',
                ),
            2511001 =>
                array (
                    'name' => '声望-太皇城',
                ),
            2511002 =>
                array (
                    'name' => '声望-太明城',
                ),
            2511003 =>
                array (
                    'name' => '声望-清明城',
                ),
            2511004 =>
                array (
                    'name' => '声望-玄胎城',
                ),
            2511005 =>
                array (
                    'name' => '声望-元明城',
                ),
            2511006 =>
                array (
                    'name' => '声望-七曜城',
                ),
            2511007 =>
                array (
                    'name' => '声望-虚无城',
                ),
            2511008 =>
                array (
                    'name' => '声望-八极城',
                ),
            2511009 =>
                array (
                    'name' => '声望-赤明城',
                ),
            2511010 =>
                array (
                    'name' => '声望-玄明城',
                ),
            2511011 =>
                array (
                    'name' => '声望-耀明城',
                ),
            2511012 =>
                array (
                    'name' => '声望-竺落城',
                ),
            2511013 =>
                array (
                    'name' => '声望-虚明城',
                ),
            2511014 =>
                array (
                    'name' => '声望-观明城',
                ),
            2511015 =>
                array (
                    'name' => '声望-玄明城',
                ),
            2511016 =>
                array (
                    'name' => '声望-太焕城',
                ),
            2511017 =>
                array (
                    'name' => '声望-元载城',
                ),
            2511018 =>
                array (
                    'name' => '声望-太安城',
                ),
            2511019 =>
                array (
                    'name' => '声望-显定城',
                ),
            2511020 =>
                array (
                    'name' => '声望-始黄城',
                ),
            2511021 =>
                array (
                    'name' => '声望-太黄城',
                ),
            2511022 =>
                array (
                    'name' => '声望-无思城',
                ),
            2511023 =>
                array (
                    'name' => '声望-上揲城',
                ),
            2511024 =>
                array (
                    'name' => '声望-无极城',
                ),
            2511025 =>
                array (
                    'name' => '声望-皓庭城',
                ),
            2511026 =>
                array (
                    'name' => '声望-渊通城',
                ),
            2511027 =>
                array (
                    'name' => '声望-翰宠城',
                ),
            2511028 =>
                array (
                    'name' => '声望-秀乐城',
                ),
            2511029 =>
                array (
                    'name' => '声望-无上城',
                ),
            2511030 =>
                array (
                    'name' => '声望-玉隆城',
                ),
            2511031 =>
                array (
                    'name' => '声望-龙变城',
                ),
            2511032 =>
                array (
                    'name' => '声望-平育城',
                ),
            2511033 =>
                array (
                    'name' => '声望-太清城',
                ),
            2511034 =>
                array (
                    'name' => '声望-上清城',
                ),
            2511035 =>
                array (
                    'name' => '声望-玉清城',
                ),
            3001000 =>
                array (
                    'name' => '随机招式',
                ),
            3001001 =>
                array (
                    'name' => '神剑诀',
                ),
            3001002 =>
                array (
                    'name' => '辟邪剑法',
                ),
            3001003 =>
                array (
                    'name' => '摧枯拉朽',
                ),
            3001004 =>
                array (
                    'name' => '斗转星移',
                ),
            3001005 =>
                array (
                    'name' => '倾城之恋',
                ),
            3001006 =>
                array (
                    'name' => '夺命十三剑',
                ),
            3001007 =>
                array (
                    'name' => '破红尘',
                ),
            3001008 =>
                array (
                    'name' => '明玉功',
                ),
            3001009 =>
                array (
                    'name' => '枯木神功',
                ),
            3001010 =>
                array (
                    'name' => '焚石化血',
                ),
            3001011 =>
                array (
                    'name' => '噬日吸星',
                ),
            3001012 =>
                array (
                    'name' => '碧落黄泉',
                ),
            3001013 =>
                array (
                    'name' => '天罡剑气',
                ),
            3001014 =>
                array (
                    'name' => '天地俱焚',
                ),
            3001015 =>
                array (
                    'name' => '一剑隔世',
                ),
            3001016 =>
                array (
                    'name' => '玉女素心剑',
                ),
            3001017 =>
                array (
                    'name' => '独孤九剑',
                ),
            3001018 =>
                array (
                    'name' => '雪天一色',
                ),
            3001019 =>
                array (
                    'name' => '风雷剑法',
                ),
            3001020 =>
                array (
                    'name' => '七巧锁心剑',
                ),
            3001021 =>
                array (
                    'name' => '迎风一刀斩',
                ),
            3001022 =>
                array (
                    'name' => '乾坤一掷',
                ),
            3001023 =>
                array (
                    'name' => '偷天换日',
                ),
            3001024 =>
                array (
                    'name' => '万象乾坤剑',
                ),
            3001025 =>
                array (
                    'name' => '二天一流',
                ),
            3001026 =>
                array (
                    'name' => '天雷破',
                ),
            3001027 =>
                array (
                    'name' => '千蛛万毒',
                ),
            3001028 =>
                array (
                    'name' => '无情三绝斩',
                ),
            3001029 =>
                array (
                    'name' => '烈火罩',
                ),
            3001030 =>
                array (
                    'name' => '金钟罩',
                ),
            3001031 =>
                array (
                    'name' => '洗髓经',
                ),
            3001032 =>
                array (
                    'name' => '神锋无影',
                ),
            3001033 =>
                array (
                    'name' => '太极八卦剑',
                ),
            3001034 =>
                array (
                    'name' => '赤蝎摆尾',
                ),
            3001035 =>
                array (
                    'name' => '分光化影',
                ),
            3001036 =>
                array (
                    'name' => '嫁衣神功',
                ),
            3001037 =>
                array (
                    'name' => '剑神一笑',
                ),
            3001038 =>
                array (
                    'name' => '落花吹雪',
                ),
            3001039 =>
                array (
                    'name' => '易筋经',
                ),
            3001040 =>
                array (
                    'name' => '追魂夺命剑',
                ),
            6011001 =>
                array (
                    'name' => 'Lottery_随机下品剑器',
                ),
            6011002 =>
                array (
                    'name' => 'Lottery_随机中品剑器',
                ),
            6011003 =>
                array (
                    'name' => 'Lottery_随机上品剑器',
                ),
            6011004 =>
                array (
                    'name' => 'Lottery_随机极品剑器',
                ),
            6011005 =>
                array (
                    'name' => 'Lottery_随机灵阶剑器',
                ),
            6011006 =>
                array (
                    'name' => 'Lottery_随机圣阶剑器',
                ),
            6011007 =>
                array (
                    'name' => 'Lottery_随机神阶剑器',
                ),
            6011008 =>
                array (
                    'name' => 'Lottery_随机剑器',
                ),
            6011011 =>
                array (
                    'name' => 'Lottery_随机下品剑器碎片',
                ),
            6011012 =>
                array (
                    'name' => 'Lottery_随机中品剑器碎片',
                ),
            6011013 =>
                array (
                    'name' => 'Lottery_随机上品剑器碎片',
                ),
            6011014 =>
                array (
                    'name' => 'Lottery_随机极品剑器碎片',
                ),
            6011015 =>
                array (
                    'name' => 'Lottery_随机灵阶剑器碎片',
                ),
            6011016 =>
                array (
                    'name' => 'Lottery_随机圣阶剑器碎片',
                ),
            6011017 =>
                array (
                    'name' => 'Lottery_随机神阶剑器碎片',
                ),
            6011018 =>
                array (
                    'name' => 'Lottery_随机剑器碎片',
                ),
            6011021 =>
                array (
                    'name' => 'Lottery_随机剑魄材料',
                ),
            6011022 =>
                array (
                    'name' => 'Lottery_随机丹方',
                ),
            6011023 =>
                array (
                    'name' => 'Lottery_随机器图',
                ),
            6011024 =>
                array (
                    'name' => 'Lottery_随机丹药属性材料',
                ),
            6011025 =>
                array (
                    'name' => 'Lottery_随机丹药层阶材料',
                ),
            6011026 =>
                array (
                    'name' => 'Lottery_随机灵宝属性材料',
                ),
            6011027 =>
                array (
                    'name' => 'Lottery_随机灵宝层阶材料',
                ),
            6011031 =>
                array (
                    'name' => 'Lottery_随机下品丹药',
                ),
            6011032 =>
                array (
                    'name' => 'Lottery_随机中品丹药',
                ),
            6011033 =>
                array (
                    'name' => 'Lottery_随机上品丹药',
                ),
            6011034 =>
                array (
                    'name' => 'Lottery_随机极品丹药',
                ),
            6011035 =>
                array (
                    'name' => 'Lottery_随机王品丹药',
                ),
            6011036 =>
                array (
                    'name' => 'Lottery_随机皇品丹药',
                ),
            6011037 =>
                array (
                    'name' => 'Lottery_随机帝品丹药',
                ),
            6011041 =>
                array (
                    'name' => 'Lottery_随机下品灵宝',
                ),
            6011042 =>
                array (
                    'name' => 'Lottery_随机中品灵宝',
                ),
            6011043 =>
                array (
                    'name' => 'Lottery_随机上品灵宝',
                ),
            6011044 =>
                array (
                    'name' => 'Lottery_随机极品灵宝',
                ),
            6011045 =>
                array (
                    'name' => 'Lottery_随机王品灵宝',
                ),
            6011046 =>
                array (
                    'name' => 'Lottery_随机皇品灵宝',
                ),
            6011047 =>
                array (
                    'name' => 'Lottery_随机帝品灵宝',
                ),
            6011101 =>
                array (
                    'name' => 'Lottery_随机1阶宝石',
                ),
            6011102 =>
                array (
                    'name' => 'Lottery_随机2阶宝石',
                ),
            6011103 =>
                array (
                    'name' => 'Lottery_随机3阶宝石',
                ),
            6011104 =>
                array (
                    'name' => 'Lottery_随机4阶宝石',
                ),
            6011105 =>
                array (
                    'name' => 'Lottery_随机5阶宝石',
                ),
            6011106 =>
                array (
                    'name' => 'Lottery_随机6阶宝石',
                ),
            6011107 =>
                array (
                    'name' => 'Lottery_随机7阶宝石',
                ),
            6011108 =>
                array (
                    'name' => 'Lottery_随机8阶宝石',
                ),
            6011109 =>
                array (
                    'name' => 'Lottery_随机9阶宝石',
                ),
            6011110 =>
                array (
                    'name' => 'Lottery_随机10阶宝石',
                ),
            6012001 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_1级装备',
                ),
            6012002 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_10级装备',
                ),
            6012003 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_20级装备',
                ),
            6012004 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_50级装备',
                ),
            6012005 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_80级装备',
                ),
            6012006 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_100级装备',
                ),
            6012007 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_150级装备',
                ),
            6012008 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_250级装备',
                ),
            6012009 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_350级装备',
                ),
            6012010 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_450级装备',
                ),
            6012011 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_550级装备',
                ),
            6012012 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_650级装备',
                ),
            6012013 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_750级装备',
                ),
            6012014 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_850级装备',
                ),
            6012015 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_1000级装备',
                ),
            6012101 =>
                array (
                    'name' => 'Lottery_主线关卡扫荡_杂项',
                ),
            6012201 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_1级装备',
                ),
            6012202 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_10级装备',
                ),
            6012203 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_20级装备',
                ),
            6012204 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_50级装备',
                ),
            6012205 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_80级装备',
                ),
            6012206 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_100级装备',
                ),
            6012207 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_150级装备',
                ),
            6012208 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_250级装备',
                ),
            6012209 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_350级装备',
                ),
            6012210 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_450级装备',
                ),
            6012211 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_550级装备',
                ),
            6012212 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_650级装备',
                ),
            6012213 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_750级装备',
                ),
            6012214 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_850级装备',
                ),
            6012215 =>
                array (
                    'name' => 'Lottery_主线关卡挑战_1000级装备',
                ),
            6013001 =>
                array (
                    'name' => 'Lottery_锁妖塔_20级装备',
                ),
            6013002 =>
                array (
                    'name' => 'Lottery_锁妖塔_50级装备',
                ),
            6013003 =>
                array (
                    'name' => 'Lottery_锁妖塔_80级装备',
                ),
            6013004 =>
                array (
                    'name' => 'Lottery_锁妖塔_100级装备',
                ),
            6013005 =>
                array (
                    'name' => 'Lottery_锁妖塔_150级装备',
                ),
            6013006 =>
                array (
                    'name' => 'Lottery_锁妖塔_250级装备',
                ),
            6013007 =>
                array (
                    'name' => 'Lottery_锁妖塔_350级装备',
                ),
            6013008 =>
                array (
                    'name' => 'Lottery_锁妖塔_450级装备',
                ),
            6013009 =>
                array (
                    'name' => 'Lottery_锁妖塔_550级装备',
                ),
            6013010 =>
                array (
                    'name' => 'Lottery_锁妖塔_650级装备',
                ),
            6013011 =>
                array (
                    'name' => 'Lottery_锁妖塔_750级装备',
                ),
            6013012 =>
                array (
                    'name' => 'Lottery_锁妖塔_850级装备',
                ),
            6013013 =>
                array (
                    'name' => 'Lottery_锁妖塔_1000级装备',
                ),
            6014001 =>
                array (
                    'name' => 'Lottery_镇魔塔_20级装备',
                ),
            6014002 =>
                array (
                    'name' => 'Lottery_镇魔塔_50级装备',
                ),
            6014003 =>
                array (
                    'name' => 'Lottery_镇魔塔_80级装备',
                ),
            6014004 =>
                array (
                    'name' => 'Lottery_镇魔塔_100级装备',
                ),
            6014005 =>
                array (
                    'name' => 'Lottery_镇魔塔_150级装备',
                ),
            6014006 =>
                array (
                    'name' => 'Lottery_镇魔塔_250级装备',
                ),
            6014007 =>
                array (
                    'name' => 'Lottery_镇魔塔_350级装备',
                ),
            6014008 =>
                array (
                    'name' => 'Lottery_镇魔塔_450级装备',
                ),
            6014009 =>
                array (
                    'name' => 'Lottery_镇魔塔_550级装备',
                ),
            6014010 =>
                array (
                    'name' => 'Lottery_镇魔塔_650级装备',
                ),
            6014011 =>
                array (
                    'name' => 'Lottery_镇魔塔_750级装备',
                ),
            6014012 =>
                array (
                    'name' => 'Lottery_镇魔塔_850级装备',
                ),
            6014013 =>
                array (
                    'name' => 'Lottery_镇魔塔_1000级装备',
                ),
            6015001 =>
                array (
                    'name' => 'Lottery_上古剑冢喽啰1',
                ),
            6015002 =>
                array (
                    'name' => 'Lottery_上古剑冢喽啰2',
                ),
            6015003 =>
                array (
                    'name' => 'Lottery_上古剑冢喽啰3',
                ),
            6015011 =>
                array (
                    'name' => 'Lottery_上古剑冢剑器碎片',
                ),
            6015012 =>
                array (
                    'name' => 'Lottery_上古剑冢剑魄',
                ),
            6015501 =>
                array (
                    'name' => 'Lottery_神魔遗迹喽啰',
                ),
            6015502 =>
                array (
                    'name' => 'Lottery_神魔遗迹事件',
                ),
            6015601 =>
                array (
                    'name' => 'Lottery_剑池首抽',
                ),
            6015602 =>
                array (
                    'name' => 'Lottery_剑池剑令召唤常规奖励',
                ),
            6015603 =>
                array (
                    'name' => 'Lottery_剑池契约召唤大R',
                ),
            6015604 =>
                array (
                    'name' => 'Lottery_剑池契约召唤常规奖励',
                ),
            6015605 =>
                array (
                    'name' => 'Lottery_剑池混沌青莲奖励',
                ),
            6015606 =>
                array (
                    'name' => 'Lottery_剑池契约召唤小R',
                ),
            6015607 =>
                array (
                    'name' => 'Lottery_剑池契约召唤中R',
                ),
            6015701 =>
                array (
                    'name' => 'Lottery_十二葬地宝石1',
                ),
            6015702 =>
                array (
                    'name' => 'Lottery_十二葬地宝石2',
                ),
            6015703 =>
                array (
                    'name' => 'Lottery_十二葬地宝石3',
                ),
            6015704 =>
                array (
                    'name' => 'Lottery_十二葬地宝石4',
                ),
            6015705 =>
                array (
                    'name' => 'Lottery_十二葬地宝石5',
                ),
            6015706 =>
                array (
                    'name' => 'Lottery_十二葬地宝石6',
                ),
            6015707 =>
                array (
                    'name' => 'Lottery_十二葬地宝石7',
                ),
            6015708 =>
                array (
                    'name' => 'Lottery_十二葬地宝石8',
                ),
            6015709 =>
                array (
                    'name' => 'Lottery_十二葬地宝石9',
                ),
            6015710 =>
                array (
                    'name' => 'Lottery_十二葬地宝石10',
                ),
            6015711 =>
                array (
                    'name' => 'Lottery_十二葬地宝石11',
                ),
            6015712 =>
                array (
                    'name' => 'Lottery_十二葬地宝石12',
                ),
            6015801 =>
                array (
                    'name' => 'Lottery_十二葬地饰品1',
                ),
            6015802 =>
                array (
                    'name' => 'Lottery_十二葬地饰品2',
                ),
            6015803 =>
                array (
                    'name' => 'Lottery_十二葬地饰品3',
                ),
            6015804 =>
                array (
                    'name' => 'Lottery_十二葬地饰品4',
                ),
            6015805 =>
                array (
                    'name' => 'Lottery_十二葬地饰品5',
                ),
            6015806 =>
                array (
                    'name' => 'Lottery_十二葬地饰品6',
                ),
            6015807 =>
                array (
                    'name' => 'Lottery_十二葬地饰品7',
                ),
            6015808 =>
                array (
                    'name' => 'Lottery_十二葬地饰品8',
                ),
            6015809 =>
                array (
                    'name' => 'Lottery_十二葬地饰品9',
                ),
            6015810 =>
                array (
                    'name' => 'Lottery_十二葬地饰品10',
                ),
            6015811 =>
                array (
                    'name' => 'Lottery_十二葬地饰品11',
                ),
            6015812 =>
                array (
                    'name' => 'Lottery_十二葬地饰品12',
                ),
            6015813 =>
                array (
                    'name' => 'Lottery_十二葬地饰品13',
                ),
            6015814 =>
                array (
                    'name' => 'Lottery_十二葬地饰品14',
                ),
            6015815 =>
                array (
                    'name' => 'Lottery_十二葬地饰品15',
                ),
            6015816 =>
                array (
                    'name' => 'Lottery_十二葬地饰品16',
                ),
            6015817 =>
                array (
                    'name' => 'Lottery_十二葬地饰品17',
                ),
            6015818 =>
                array (
                    'name' => 'Lottery_十二葬地饰品18',
                ),
            6015819 =>
                array (
                    'name' => 'Lottery_十二葬地饰品19',
                ),
            6015820 =>
                array (
                    'name' => 'Lottery_十二葬地饰品20',
                ),
            6015821 =>
                array (
                    'name' => 'Lottery_十二葬地饰品21',
                ),
            6015822 =>
                array (
                    'name' => 'Lottery_十二葬地饰品22',
                ),
            6015823 =>
                array (
                    'name' => 'Lottery_十二葬地饰品23',
                ),
            6015824 =>
                array (
                    'name' => 'Lottery_十二葬地饰品24',
                ),
            6015825 =>
                array (
                    'name' => 'Lottery_十二葬地饰品25',
                ),
            6015826 =>
                array (
                    'name' => 'Lottery_十二葬地饰品26',
                ),
            6015827 =>
                array (
                    'name' => 'Lottery_十二葬地饰品27',
                ),
            6015828 =>
                array (
                    'name' => 'Lottery_十二葬地饰品28',
                ),
            6015829 =>
                array (
                    'name' => 'Lottery_十二葬地饰品29',
                ),
            6015830 =>
                array (
                    'name' => 'Lottery_十二葬地饰品30',
                ),
            6015831 =>
                array (
                    'name' => 'Lottery_十二葬地饰品31',
                ),
            6015832 =>
                array (
                    'name' => 'Lottery_十二葬地饰品32',
                ),
            6015833 =>
                array (
                    'name' => 'Lottery_十二葬地饰品33',
                ),
            6015834 =>
                array (
                    'name' => 'Lottery_十二葬地饰品34',
                ),
            6015835 =>
                array (
                    'name' => 'Lottery_十二葬地饰品35',
                ),
            6015836 =>
                array (
                    'name' => 'Lottery_十二葬地饰品36',
                ),
            6015837 =>
                array (
                    'name' => 'Lottery_十二葬地饰品37',
                ),
            6015838 =>
                array (
                    'name' => 'Lottery_十二葬地饰品38',
                ),
            6015839 =>
                array (
                    'name' => 'Lottery_十二葬地饰品39',
                ),
            6016001 =>
                array (
                    'name' => 'Lottery_熔炼下品装备',
                ),
            6016002 =>
                array (
                    'name' => 'Lottery_熔炼中品装备',
                ),
            6016003 =>
                array (
                    'name' => 'Lottery_熔炼上品装备',
                ),
            6016004 =>
                array (
                    'name' => 'Lottery_熔炼极品装备',
                ),
            6016005 =>
                array (
                    'name' => 'Lottery_熔炼王品装备',
                ),
            6016006 =>
                array (
                    'name' => 'Lottery_熔炼皇品装备',
                ),
            6016007 =>
                array (
                    'name' => 'Lottery_熔炼帝品装备',
                ),
            6016011 =>
                array (
                    'name' => 'Lottery_随机剑心品质1',
                ),
            6016012 =>
                array (
                    'name' => 'Lottery_随机剑心品质2',
                ),
            6016013 =>
                array (
                    'name' => 'Lottery_随机剑心品质3',
                ),
            6016014 =>
                array (
                    'name' => 'Lottery_随机剑心品质4',
                ),
            6016015 =>
                array (
                    'name' => 'Lottery_随机剑心品质5',
                ),
            6016016 =>
                array (
                    'name' => 'Lottery_随机剑心品质6',
                ),
            6016017 =>
                array (
                    'name' => 'Lottery_随机剑心品质7',
                ),
            6017101 =>
                array (
                    'name' => 'Lottery_50%概率获得遗书',
                ),
            6017102 =>
                array (
                    'name' => 'Lottery_50%概率获得火云果判定',
                ),
            6018001 =>
                array (
                    'name' => 'Lottery_地图资源_丹药材料',
                ),
            6018002 =>
                array (
                    'name' => 'Lottery_地图资源_灵宝材料',
                ),
            6018003 =>
                array (
                    'name' => 'Lottery_地图资源',
                ),
            60110001 =>
                array (
                    'name' => 'Lottery_随机1级下品装备',
                ),
            60110002 =>
                array (
                    'name' => 'Lottery_随机1级中品装备',
                ),
            60110003 =>
                array (
                    'name' => 'Lottery_随机1级上品装备',
                ),
            60110004 =>
                array (
                    'name' => 'Lottery_随机1级极品装备',
                ),
            60110005 =>
                array (
                    'name' => 'Lottery_随机1级王品装备',
                ),
            60110006 =>
                array (
                    'name' => 'Lottery_随机1级皇品装备',
                ),
            60110007 =>
                array (
                    'name' => 'Lottery_随机1级帝品装备',
                ),
            60110011 =>
                array (
                    'name' => 'Lottery_随机10级下品装备',
                ),
            60110012 =>
                array (
                    'name' => 'Lottery_随机10级中品装备',
                ),
            60110013 =>
                array (
                    'name' => 'Lottery_随机10级上品装备',
                ),
            60110014 =>
                array (
                    'name' => 'Lottery_随机10级极品装备',
                ),
            60110015 =>
                array (
                    'name' => 'Lottery_随机10级王品装备',
                ),
            60110016 =>
                array (
                    'name' => 'Lottery_随机10级皇品装备',
                ),
            60110017 =>
                array (
                    'name' => 'Lottery_随机10级帝品装备',
                ),
            60110021 =>
                array (
                    'name' => 'Lottery_随机20级下品装备',
                ),
            60110022 =>
                array (
                    'name' => 'Lottery_随机20级中品装备',
                ),
            60110023 =>
                array (
                    'name' => 'Lottery_随机20级上品装备',
                ),
            60110024 =>
                array (
                    'name' => 'Lottery_随机20级极品装备',
                ),
            60110025 =>
                array (
                    'name' => 'Lottery_随机20级王品装备',
                ),
            60110026 =>
                array (
                    'name' => 'Lottery_随机20级皇品装备',
                ),
            60110027 =>
                array (
                    'name' => 'Lottery_随机20级帝品装备',
                ),
            60110031 =>
                array (
                    'name' => 'Lottery_随机50级下品装备',
                ),
            60110032 =>
                array (
                    'name' => 'Lottery_随机50级中品装备',
                ),
            60110033 =>
                array (
                    'name' => 'Lottery_随机50级上品装备',
                ),
            60110034 =>
                array (
                    'name' => 'Lottery_随机50级极品装备',
                ),
            60110035 =>
                array (
                    'name' => 'Lottery_随机50级王品装备',
                ),
            60110036 =>
                array (
                    'name' => 'Lottery_随机50级皇品装备',
                ),
            60110037 =>
                array (
                    'name' => 'Lottery_随机50级帝品装备',
                ),
            60110041 =>
                array (
                    'name' => 'Lottery_随机80级下品装备',
                ),
            60110042 =>
                array (
                    'name' => 'Lottery_随机80级中品装备',
                ),
            60110043 =>
                array (
                    'name' => 'Lottery_随机80级上品装备',
                ),
            60110044 =>
                array (
                    'name' => 'Lottery_随机80级极品装备',
                ),
            60110045 =>
                array (
                    'name' => 'Lottery_随机80级王品装备',
                ),
            60110046 =>
                array (
                    'name' => 'Lottery_随机80级皇品装备',
                ),
            60110047 =>
                array (
                    'name' => 'Lottery_随机80级帝品装备',
                ),
            60110051 =>
                array (
                    'name' => 'Lottery_随机100级下品装备',
                ),
            60110052 =>
                array (
                    'name' => 'Lottery_随机100级中品装备',
                ),
            60110053 =>
                array (
                    'name' => 'Lottery_随机100级上品装备',
                ),
            60110054 =>
                array (
                    'name' => 'Lottery_随机100级极品装备',
                ),
            60110055 =>
                array (
                    'name' => 'Lottery_随机100级王品装备',
                ),
            60110056 =>
                array (
                    'name' => 'Lottery_随机100级皇品装备',
                ),
            60110057 =>
                array (
                    'name' => 'Lottery_随机100级帝品装备',
                ),
            60110061 =>
                array (
                    'name' => 'Lottery_随机150级下品装备',
                ),
            60110062 =>
                array (
                    'name' => 'Lottery_随机150级中品装备',
                ),
            60110063 =>
                array (
                    'name' => 'Lottery_随机150级上品装备',
                ),
            60110064 =>
                array (
                    'name' => 'Lottery_随机150级极品装备',
                ),
            60110065 =>
                array (
                    'name' => 'Lottery_随机150级王品装备',
                ),
            60110066 =>
                array (
                    'name' => 'Lottery_随机150级皇品装备',
                ),
            60110067 =>
                array (
                    'name' => 'Lottery_随机150级帝品装备',
                ),
            60110071 =>
                array (
                    'name' => 'Lottery_随机250级下品装备',
                ),
            60110072 =>
                array (
                    'name' => 'Lottery_随机250级中品装备',
                ),
            60110073 =>
                array (
                    'name' => 'Lottery_随机250级上品装备',
                ),
            60110074 =>
                array (
                    'name' => 'Lottery_随机250级极品装备',
                ),
            60110075 =>
                array (
                    'name' => 'Lottery_随机250级王品装备',
                ),
            60110076 =>
                array (
                    'name' => 'Lottery_随机250级皇品装备',
                ),
            60110077 =>
                array (
                    'name' => 'Lottery_随机250级帝品装备',
                ),
            60110081 =>
                array (
                    'name' => 'Lottery_随机350级下品装备',
                ),
            60110082 =>
                array (
                    'name' => 'Lottery_随机350级中品装备',
                ),
            60110083 =>
                array (
                    'name' => 'Lottery_随机350级上品装备',
                ),
            60110084 =>
                array (
                    'name' => 'Lottery_随机350级极品装备',
                ),
            60110085 =>
                array (
                    'name' => 'Lottery_随机350级王品装备',
                ),
            60110086 =>
                array (
                    'name' => 'Lottery_随机350级皇品装备',
                ),
            60110087 =>
                array (
                    'name' => 'Lottery_随机350级帝品装备',
                ),
            60110091 =>
                array (
                    'name' => 'Lottery_随机450级下品装备',
                ),
            60110092 =>
                array (
                    'name' => 'Lottery_随机450级中品装备',
                ),
            60110093 =>
                array (
                    'name' => 'Lottery_随机450级上品装备',
                ),
            60110094 =>
                array (
                    'name' => 'Lottery_随机450级极品装备',
                ),
            60110095 =>
                array (
                    'name' => 'Lottery_随机450级王品装备',
                ),
            60110096 =>
                array (
                    'name' => 'Lottery_随机450级皇品装备',
                ),
            60110097 =>
                array (
                    'name' => 'Lottery_随机450级帝品装备',
                ),
            60110101 =>
                array (
                    'name' => 'Lottery_随机550级下品装备',
                ),
            60110102 =>
                array (
                    'name' => 'Lottery_随机550级中品装备',
                ),
            60110103 =>
                array (
                    'name' => 'Lottery_随机550级上品装备',
                ),
            60110104 =>
                array (
                    'name' => 'Lottery_随机550级极品装备',
                ),
            60110105 =>
                array (
                    'name' => 'Lottery_随机550级王品装备',
                ),
            60110106 =>
                array (
                    'name' => 'Lottery_随机550级皇品装备',
                ),
            60110107 =>
                array (
                    'name' => 'Lottery_随机550级帝品装备',
                ),
            60110111 =>
                array (
                    'name' => 'Lottery_随机650级下品装备',
                ),
            60110112 =>
                array (
                    'name' => 'Lottery_随机650级中品装备',
                ),
            60110113 =>
                array (
                    'name' => 'Lottery_随机650级上品装备',
                ),
            60110114 =>
                array (
                    'name' => 'Lottery_随机650级极品装备',
                ),
            60110115 =>
                array (
                    'name' => 'Lottery_随机650级王品装备',
                ),
            60110116 =>
                array (
                    'name' => 'Lottery_随机650级皇品装备',
                ),
            60110117 =>
                array (
                    'name' => 'Lottery_随机650级帝品装备',
                ),
            60110121 =>
                array (
                    'name' => 'Lottery_随机750级下品装备',
                ),
            60110122 =>
                array (
                    'name' => 'Lottery_随机750级中品装备',
                ),
            60110123 =>
                array (
                    'name' => 'Lottery_随机750级上品装备',
                ),
            60110124 =>
                array (
                    'name' => 'Lottery_随机750级极品装备',
                ),
            60110125 =>
                array (
                    'name' => 'Lottery_随机750级王品装备',
                ),
            60110126 =>
                array (
                    'name' => 'Lottery_随机750级皇品装备',
                ),
            60110127 =>
                array (
                    'name' => 'Lottery_随机750级帝品装备',
                ),
            60110131 =>
                array (
                    'name' => 'Lottery_随机850级下品装备',
                ),
            60110132 =>
                array (
                    'name' => 'Lottery_随机850级中品装备',
                ),
            60110133 =>
                array (
                    'name' => 'Lottery_随机850级上品装备',
                ),
            60110134 =>
                array (
                    'name' => 'Lottery_随机850级极品装备',
                ),
            60110135 =>
                array (
                    'name' => 'Lottery_随机850级王品装备',
                ),
            60110136 =>
                array (
                    'name' => 'Lottery_随机850级皇品装备',
                ),
            60110137 =>
                array (
                    'name' => 'Lottery_随机850级帝品装备',
                ),
            60110141 =>
                array (
                    'name' => 'Lottery_随机1000级下品装备',
                ),
            60110142 =>
                array (
                    'name' => 'Lottery_随机1000级中品装备',
                ),
            60110143 =>
                array (
                    'name' => 'Lottery_随机1000级上品装备',
                ),
            60110144 =>
                array (
                    'name' => 'Lottery_随机1000级极品装备',
                ),
            60110145 =>
                array (
                    'name' => 'Lottery_随机1000级王品装备',
                ),
            60110146 =>
                array (
                    'name' => 'Lottery_随机1000级皇品装备',
                ),
            60110147 =>
                array (
                    'name' => 'Lottery_随机1000级帝品装备',
                ),
            60120001 =>
                array (
                    'name' => 'Lottery_随机50级下品饰品',
                ),
            60120002 =>
                array (
                    'name' => 'Lottery_随机50级中品饰品',
                ),
            60120003 =>
                array (
                    'name' => 'Lottery_随机50级上品饰品',
                ),
            60120004 =>
                array (
                    'name' => 'Lottery_随机50级极品饰品',
                ),
            60120005 =>
                array (
                    'name' => 'Lottery_随机50级王品饰品',
                ),
            60120006 =>
                array (
                    'name' => 'Lottery_随机50级皇品饰品',
                ),
            60120007 =>
                array (
                    'name' => 'Lottery_随机50级帝品饰品',
                ),
            60120011 =>
                array (
                    'name' => 'Lottery_随机80级下品饰品',
                ),
            60120012 =>
                array (
                    'name' => 'Lottery_随机80级中品饰品',
                ),
            60120013 =>
                array (
                    'name' => 'Lottery_随机80级上品饰品',
                ),
            60120014 =>
                array (
                    'name' => 'Lottery_随机80级极品饰品',
                ),
            60120015 =>
                array (
                    'name' => 'Lottery_随机80级王品饰品',
                ),
            60120016 =>
                array (
                    'name' => 'Lottery_随机80级皇品饰品',
                ),
            60120017 =>
                array (
                    'name' => 'Lottery_随机80级帝品饰品',
                ),
            60120021 =>
                array (
                    'name' => 'Lottery_随机100级下品饰品',
                ),
            60120022 =>
                array (
                    'name' => 'Lottery_随机100级中品饰品',
                ),
            60120023 =>
                array (
                    'name' => 'Lottery_随机100级上品饰品',
                ),
            60120024 =>
                array (
                    'name' => 'Lottery_随机100级极品饰品',
                ),
            60120025 =>
                array (
                    'name' => 'Lottery_随机100级王品饰品',
                ),
            60120026 =>
                array (
                    'name' => 'Lottery_随机100级皇品饰品',
                ),
            60120027 =>
                array (
                    'name' => 'Lottery_随机100级帝品饰品',
                ),
            60120031 =>
                array (
                    'name' => 'Lottery_随机120级下品饰品',
                ),
            60120032 =>
                array (
                    'name' => 'Lottery_随机120级中品饰品',
                ),
            60120033 =>
                array (
                    'name' => 'Lottery_随机120级上品饰品',
                ),
            60120034 =>
                array (
                    'name' => 'Lottery_随机120级极品饰品',
                ),
            60120035 =>
                array (
                    'name' => 'Lottery_随机120级王品饰品',
                ),
            60120036 =>
                array (
                    'name' => 'Lottery_随机120级皇品饰品',
                ),
            60120037 =>
                array (
                    'name' => 'Lottery_随机120级帝品饰品',
                ),
            60120041 =>
                array (
                    'name' => 'Lottery_随机150级下品饰品',
                ),
            60120042 =>
                array (
                    'name' => 'Lottery_随机150级中品饰品',
                ),
            60120043 =>
                array (
                    'name' => 'Lottery_随机150级上品饰品',
                ),
            60120044 =>
                array (
                    'name' => 'Lottery_随机150级极品饰品',
                ),
            60120045 =>
                array (
                    'name' => 'Lottery_随机150级王品饰品',
                ),
            60120046 =>
                array (
                    'name' => 'Lottery_随机150级皇品饰品',
                ),
            60120047 =>
                array (
                    'name' => 'Lottery_随机150级帝品饰品',
                ),
            60120051 =>
                array (
                    'name' => 'Lottery_随机180级下品饰品',
                ),
            60120052 =>
                array (
                    'name' => 'Lottery_随机180级中品饰品',
                ),
            60120053 =>
                array (
                    'name' => 'Lottery_随机180级上品饰品',
                ),
            60120054 =>
                array (
                    'name' => 'Lottery_随机180级极品饰品',
                ),
            60120055 =>
                array (
                    'name' => 'Lottery_随机180级王品饰品',
                ),
            60120056 =>
                array (
                    'name' => 'Lottery_随机180级皇品饰品',
                ),
            60120057 =>
                array (
                    'name' => 'Lottery_随机180级帝品饰品',
                ),
            60120061 =>
                array (
                    'name' => 'Lottery_随机200级下品饰品',
                ),
            60120062 =>
                array (
                    'name' => 'Lottery_随机200级中品饰品',
                ),
            60120063 =>
                array (
                    'name' => 'Lottery_随机200级上品饰品',
                ),
            60120064 =>
                array (
                    'name' => 'Lottery_随机200级极品饰品',
                ),
            60120065 =>
                array (
                    'name' => 'Lottery_随机200级王品饰品',
                ),
            60120066 =>
                array (
                    'name' => 'Lottery_随机200级皇品饰品',
                ),
            60120067 =>
                array (
                    'name' => 'Lottery_随机200级帝品饰品',
                ),
            60120071 =>
                array (
                    'name' => 'Lottery_随机220级下品饰品',
                ),
            60120072 =>
                array (
                    'name' => 'Lottery_随机220级中品饰品',
                ),
            60120073 =>
                array (
                    'name' => 'Lottery_随机220级上品饰品',
                ),
            60120074 =>
                array (
                    'name' => 'Lottery_随机220级极品饰品',
                ),
            60120075 =>
                array (
                    'name' => 'Lottery_随机220级王品饰品',
                ),
            60120076 =>
                array (
                    'name' => 'Lottery_随机220级皇品饰品',
                ),
            60120077 =>
                array (
                    'name' => 'Lottery_随机220级帝品饰品',
                ),
            60120081 =>
                array (
                    'name' => 'Lottery_随机250级下品饰品',
                ),
            60120082 =>
                array (
                    'name' => 'Lottery_随机250级中品饰品',
                ),
            60120083 =>
                array (
                    'name' => 'Lottery_随机250级上品饰品',
                ),
            60120084 =>
                array (
                    'name' => 'Lottery_随机250级极品饰品',
                ),
            60120085 =>
                array (
                    'name' => 'Lottery_随机250级王品饰品',
                ),
            60120086 =>
                array (
                    'name' => 'Lottery_随机250级皇品饰品',
                ),
            60120087 =>
                array (
                    'name' => 'Lottery_随机250级帝品饰品',
                ),
            60120091 =>
                array (
                    'name' => 'Lottery_随机280级下品饰品',
                ),
            60120092 =>
                array (
                    'name' => 'Lottery_随机280级中品饰品',
                ),
            60120093 =>
                array (
                    'name' => 'Lottery_随机280级上品饰品',
                ),
            60120094 =>
                array (
                    'name' => 'Lottery_随机280级极品饰品',
                ),
            60120095 =>
                array (
                    'name' => 'Lottery_随机280级王品饰品',
                ),
            60120096 =>
                array (
                    'name' => 'Lottery_随机280级皇品饰品',
                ),
            60120097 =>
                array (
                    'name' => 'Lottery_随机280级帝品饰品',
                ),
            60120101 =>
                array (
                    'name' => 'Lottery_随机300级下品饰品',
                ),
            60120102 =>
                array (
                    'name' => 'Lottery_随机300级中品饰品',
                ),
            60120103 =>
                array (
                    'name' => 'Lottery_随机300级上品饰品',
                ),
            60120104 =>
                array (
                    'name' => 'Lottery_随机300级极品饰品',
                ),
            60120105 =>
                array (
                    'name' => 'Lottery_随机300级王品饰品',
                ),
            60120106 =>
                array (
                    'name' => 'Lottery_随机300级皇品饰品',
                ),
            60120107 =>
                array (
                    'name' => 'Lottery_随机300级帝品饰品',
                ),
            60120111 =>
                array (
                    'name' => 'Lottery_随机320级下品饰品',
                ),
            60120112 =>
                array (
                    'name' => 'Lottery_随机320级中品饰品',
                ),
            60120113 =>
                array (
                    'name' => 'Lottery_随机320级上品饰品',
                ),
            60120114 =>
                array (
                    'name' => 'Lottery_随机320级极品饰品',
                ),
            60120115 =>
                array (
                    'name' => 'Lottery_随机320级王品饰品',
                ),
            60120116 =>
                array (
                    'name' => 'Lottery_随机320级皇品饰品',
                ),
            60120117 =>
                array (
                    'name' => 'Lottery_随机320级帝品饰品',
                ),
            60120121 =>
                array (
                    'name' => 'Lottery_随机350级下品饰品',
                ),
            60120122 =>
                array (
                    'name' => 'Lottery_随机350级中品饰品',
                ),
            60120123 =>
                array (
                    'name' => 'Lottery_随机350级上品饰品',
                ),
            60120124 =>
                array (
                    'name' => 'Lottery_随机350级极品饰品',
                ),
            60120125 =>
                array (
                    'name' => 'Lottery_随机350级王品饰品',
                ),
            60120126 =>
                array (
                    'name' => 'Lottery_随机350级皇品饰品',
                ),
            60120127 =>
                array (
                    'name' => 'Lottery_随机350级帝品饰品',
                ),
            60120131 =>
                array (
                    'name' => 'Lottery_随机380级下品饰品',
                ),
            60120132 =>
                array (
                    'name' => 'Lottery_随机380级中品饰品',
                ),
            60120133 =>
                array (
                    'name' => 'Lottery_随机380级上品饰品',
                ),
            60120134 =>
                array (
                    'name' => 'Lottery_随机380级极品饰品',
                ),
            60120135 =>
                array (
                    'name' => 'Lottery_随机380级王品饰品',
                ),
            60120136 =>
                array (
                    'name' => 'Lottery_随机380级皇品饰品',
                ),
            60120137 =>
                array (
                    'name' => 'Lottery_随机380级帝品饰品',
                ),
            60120141 =>
                array (
                    'name' => 'Lottery_随机400级下品饰品',
                ),
            60120142 =>
                array (
                    'name' => 'Lottery_随机400级中品饰品',
                ),
            60120143 =>
                array (
                    'name' => 'Lottery_随机400级上品饰品',
                ),
            60120144 =>
                array (
                    'name' => 'Lottery_随机400级极品饰品',
                ),
            60120145 =>
                array (
                    'name' => 'Lottery_随机400级王品饰品',
                ),
            60120146 =>
                array (
                    'name' => 'Lottery_随机400级皇品饰品',
                ),
            60120147 =>
                array (
                    'name' => 'Lottery_随机400级帝品饰品',
                ),
            60120151 =>
                array (
                    'name' => 'Lottery_随机420级下品饰品',
                ),
            60120152 =>
                array (
                    'name' => 'Lottery_随机420级中品饰品',
                ),
            60120153 =>
                array (
                    'name' => 'Lottery_随机420级上品饰品',
                ),
            60120154 =>
                array (
                    'name' => 'Lottery_随机420级极品饰品',
                ),
            60120155 =>
                array (
                    'name' => 'Lottery_随机420级王品饰品',
                ),
            60120156 =>
                array (
                    'name' => 'Lottery_随机420级皇品饰品',
                ),
            60120157 =>
                array (
                    'name' => 'Lottery_随机420级帝品饰品',
                ),
            60120161 =>
                array (
                    'name' => 'Lottery_随机450级下品饰品',
                ),
            60120162 =>
                array (
                    'name' => 'Lottery_随机450级中品饰品',
                ),
            60120163 =>
                array (
                    'name' => 'Lottery_随机450级上品饰品',
                ),
            60120164 =>
                array (
                    'name' => 'Lottery_随机450级极品饰品',
                ),
            60120165 =>
                array (
                    'name' => 'Lottery_随机450级王品饰品',
                ),
            60120166 =>
                array (
                    'name' => 'Lottery_随机450级皇品饰品',
                ),
            60120167 =>
                array (
                    'name' => 'Lottery_随机450级帝品饰品',
                ),
            60120171 =>
                array (
                    'name' => 'Lottery_随机480级下品饰品',
                ),
            60120172 =>
                array (
                    'name' => 'Lottery_随机480级中品饰品',
                ),
            60120173 =>
                array (
                    'name' => 'Lottery_随机480级上品饰品',
                ),
            60120174 =>
                array (
                    'name' => 'Lottery_随机480级极品饰品',
                ),
            60120175 =>
                array (
                    'name' => 'Lottery_随机480级王品饰品',
                ),
            60120176 =>
                array (
                    'name' => 'Lottery_随机480级皇品饰品',
                ),
            60120177 =>
                array (
                    'name' => 'Lottery_随机480级帝品饰品',
                ),
            60120181 =>
                array (
                    'name' => 'Lottery_随机500级下品饰品',
                ),
            60120182 =>
                array (
                    'name' => 'Lottery_随机500级中品饰品',
                ),
            60120183 =>
                array (
                    'name' => 'Lottery_随机500级上品饰品',
                ),
            60120184 =>
                array (
                    'name' => 'Lottery_随机500级极品饰品',
                ),
            60120185 =>
                array (
                    'name' => 'Lottery_随机500级王品饰品',
                ),
            60120186 =>
                array (
                    'name' => 'Lottery_随机500级皇品饰品',
                ),
            60120187 =>
                array (
                    'name' => 'Lottery_随机500级帝品饰品',
                ),
            60120191 =>
                array (
                    'name' => 'Lottery_随机520级下品饰品',
                ),
            60120192 =>
                array (
                    'name' => 'Lottery_随机520级中品饰品',
                ),
            60120193 =>
                array (
                    'name' => 'Lottery_随机520级上品饰品',
                ),
            60120194 =>
                array (
                    'name' => 'Lottery_随机520级极品饰品',
                ),
            60120195 =>
                array (
                    'name' => 'Lottery_随机520级王品饰品',
                ),
            60120196 =>
                array (
                    'name' => 'Lottery_随机520级皇品饰品',
                ),
            60120197 =>
                array (
                    'name' => 'Lottery_随机520级帝品饰品',
                ),
            60120201 =>
                array (
                    'name' => 'Lottery_随机550级下品饰品',
                ),
            60120202 =>
                array (
                    'name' => 'Lottery_随机550级中品饰品',
                ),
            60120203 =>
                array (
                    'name' => 'Lottery_随机550级上品饰品',
                ),
            60120204 =>
                array (
                    'name' => 'Lottery_随机550级极品饰品',
                ),
            60120205 =>
                array (
                    'name' => 'Lottery_随机550级王品饰品',
                ),
            60120206 =>
                array (
                    'name' => 'Lottery_随机550级皇品饰品',
                ),
            60120207 =>
                array (
                    'name' => 'Lottery_随机550级帝品饰品',
                ),
            60120211 =>
                array (
                    'name' => 'Lottery_随机580级下品饰品',
                ),
            60120212 =>
                array (
                    'name' => 'Lottery_随机580级中品饰品',
                ),
            60120213 =>
                array (
                    'name' => 'Lottery_随机580级上品饰品',
                ),
            60120214 =>
                array (
                    'name' => 'Lottery_随机580级极品饰品',
                ),
            60120215 =>
                array (
                    'name' => 'Lottery_随机580级王品饰品',
                ),
            60120216 =>
                array (
                    'name' => 'Lottery_随机580级皇品饰品',
                ),
            60120217 =>
                array (
                    'name' => 'Lottery_随机580级帝品饰品',
                ),
            60120221 =>
                array (
                    'name' => 'Lottery_随机600级下品饰品',
                ),
            60120222 =>
                array (
                    'name' => 'Lottery_随机600级中品饰品',
                ),
            60120223 =>
                array (
                    'name' => 'Lottery_随机600级上品饰品',
                ),
            60120224 =>
                array (
                    'name' => 'Lottery_随机600级极品饰品',
                ),
            60120225 =>
                array (
                    'name' => 'Lottery_随机600级王品饰品',
                ),
            60120226 =>
                array (
                    'name' => 'Lottery_随机600级皇品饰品',
                ),
            60120227 =>
                array (
                    'name' => 'Lottery_随机600级帝品饰品',
                ),
            60120231 =>
                array (
                    'name' => 'Lottery_随机620级下品饰品',
                ),
            60120232 =>
                array (
                    'name' => 'Lottery_随机620级中品饰品',
                ),
            60120233 =>
                array (
                    'name' => 'Lottery_随机620级上品饰品',
                ),
            60120234 =>
                array (
                    'name' => 'Lottery_随机620级极品饰品',
                ),
            60120235 =>
                array (
                    'name' => 'Lottery_随机620级王品饰品',
                ),
            60120236 =>
                array (
                    'name' => 'Lottery_随机620级皇品饰品',
                ),
            60120237 =>
                array (
                    'name' => 'Lottery_随机620级帝品饰品',
                ),
            60120241 =>
                array (
                    'name' => 'Lottery_随机650级下品饰品',
                ),
            60120242 =>
                array (
                    'name' => 'Lottery_随机650级中品饰品',
                ),
            60120243 =>
                array (
                    'name' => 'Lottery_随机650级上品饰品',
                ),
            60120244 =>
                array (
                    'name' => 'Lottery_随机650级极品饰品',
                ),
            60120245 =>
                array (
                    'name' => 'Lottery_随机650级王品饰品',
                ),
            60120246 =>
                array (
                    'name' => 'Lottery_随机650级皇品饰品',
                ),
            60120247 =>
                array (
                    'name' => 'Lottery_随机650级帝品饰品',
                ),
            60120251 =>
                array (
                    'name' => 'Lottery_随机680级下品饰品',
                ),
            60120252 =>
                array (
                    'name' => 'Lottery_随机680级中品饰品',
                ),
            60120253 =>
                array (
                    'name' => 'Lottery_随机680级上品饰品',
                ),
            60120254 =>
                array (
                    'name' => 'Lottery_随机680级极品饰品',
                ),
            60120255 =>
                array (
                    'name' => 'Lottery_随机680级王品饰品',
                ),
            60120256 =>
                array (
                    'name' => 'Lottery_随机680级皇品饰品',
                ),
            60120257 =>
                array (
                    'name' => 'Lottery_随机680级帝品饰品',
                ),
            60120261 =>
                array (
                    'name' => 'Lottery_随机700级下品饰品',
                ),
            60120262 =>
                array (
                    'name' => 'Lottery_随机700级中品饰品',
                ),
            60120263 =>
                array (
                    'name' => 'Lottery_随机700级上品饰品',
                ),
            60120264 =>
                array (
                    'name' => 'Lottery_随机700级极品饰品',
                ),
            60120265 =>
                array (
                    'name' => 'Lottery_随机700级王品饰品',
                ),
            60120266 =>
                array (
                    'name' => 'Lottery_随机700级皇品饰品',
                ),
            60120267 =>
                array (
                    'name' => 'Lottery_随机700级帝品饰品',
                ),
            60120271 =>
                array (
                    'name' => 'Lottery_随机720级下品饰品',
                ),
            60120272 =>
                array (
                    'name' => 'Lottery_随机720级中品饰品',
                ),
            60120273 =>
                array (
                    'name' => 'Lottery_随机720级上品饰品',
                ),
            60120274 =>
                array (
                    'name' => 'Lottery_随机720级极品饰品',
                ),
            60120275 =>
                array (
                    'name' => 'Lottery_随机720级王品饰品',
                ),
            60120276 =>
                array (
                    'name' => 'Lottery_随机720级皇品饰品',
                ),
            60120277 =>
                array (
                    'name' => 'Lottery_随机720级帝品饰品',
                ),
            60120281 =>
                array (
                    'name' => 'Lottery_随机750级下品饰品',
                ),
            60120282 =>
                array (
                    'name' => 'Lottery_随机750级中品饰品',
                ),
            60120283 =>
                array (
                    'name' => 'Lottery_随机750级上品饰品',
                ),
            60120284 =>
                array (
                    'name' => 'Lottery_随机750级极品饰品',
                ),
            60120285 =>
                array (
                    'name' => 'Lottery_随机750级王品饰品',
                ),
            60120286 =>
                array (
                    'name' => 'Lottery_随机750级皇品饰品',
                ),
            60120287 =>
                array (
                    'name' => 'Lottery_随机750级帝品饰品',
                ),
            60120291 =>
                array (
                    'name' => 'Lottery_随机780级下品饰品',
                ),
            60120292 =>
                array (
                    'name' => 'Lottery_随机780级中品饰品',
                ),
            60120293 =>
                array (
                    'name' => 'Lottery_随机780级上品饰品',
                ),
            60120294 =>
                array (
                    'name' => 'Lottery_随机780级极品饰品',
                ),
            60120295 =>
                array (
                    'name' => 'Lottery_随机780级王品饰品',
                ),
            60120296 =>
                array (
                    'name' => 'Lottery_随机780级皇品饰品',
                ),
            60120297 =>
                array (
                    'name' => 'Lottery_随机780级帝品饰品',
                ),
            60120301 =>
                array (
                    'name' => 'Lottery_随机800级下品饰品',
                ),
            60120302 =>
                array (
                    'name' => 'Lottery_随机800级中品饰品',
                ),
            60120303 =>
                array (
                    'name' => 'Lottery_随机800级上品饰品',
                ),
            60120304 =>
                array (
                    'name' => 'Lottery_随机800级极品饰品',
                ),
            60120305 =>
                array (
                    'name' => 'Lottery_随机800级王品饰品',
                ),
            60120306 =>
                array (
                    'name' => 'Lottery_随机800级皇品饰品',
                ),
            60120307 =>
                array (
                    'name' => 'Lottery_随机800级帝品饰品',
                ),
            60120311 =>
                array (
                    'name' => 'Lottery_随机820级下品饰品',
                ),
            60120312 =>
                array (
                    'name' => 'Lottery_随机820级中品饰品',
                ),
            60120313 =>
                array (
                    'name' => 'Lottery_随机820级上品饰品',
                ),
            60120314 =>
                array (
                    'name' => 'Lottery_随机820级极品饰品',
                ),
            60120315 =>
                array (
                    'name' => 'Lottery_随机820级王品饰品',
                ),
            60120316 =>
                array (
                    'name' => 'Lottery_随机820级皇品饰品',
                ),
            60120317 =>
                array (
                    'name' => 'Lottery_随机820级帝品饰品',
                ),
            60120321 =>
                array (
                    'name' => 'Lottery_随机850级下品饰品',
                ),
            60120322 =>
                array (
                    'name' => 'Lottery_随机850级中品饰品',
                ),
            60120323 =>
                array (
                    'name' => 'Lottery_随机850级上品饰品',
                ),
            60120324 =>
                array (
                    'name' => 'Lottery_随机850级极品饰品',
                ),
            60120325 =>
                array (
                    'name' => 'Lottery_随机850级王品饰品',
                ),
            60120326 =>
                array (
                    'name' => 'Lottery_随机850级皇品饰品',
                ),
            60120327 =>
                array (
                    'name' => 'Lottery_随机850级帝品饰品',
                ),
            60120331 =>
                array (
                    'name' => 'Lottery_随机880级下品饰品',
                ),
            60120332 =>
                array (
                    'name' => 'Lottery_随机880级中品饰品',
                ),
            60120333 =>
                array (
                    'name' => 'Lottery_随机880级上品饰品',
                ),
            60120334 =>
                array (
                    'name' => 'Lottery_随机880级极品饰品',
                ),
            60120335 =>
                array (
                    'name' => 'Lottery_随机880级王品饰品',
                ),
            60120336 =>
                array (
                    'name' => 'Lottery_随机880级皇品饰品',
                ),
            60120337 =>
                array (
                    'name' => 'Lottery_随机880级帝品饰品',
                ),
            60120341 =>
                array (
                    'name' => 'Lottery_随机900级下品饰品',
                ),
            60120342 =>
                array (
                    'name' => 'Lottery_随机900级中品饰品',
                ),
            60120343 =>
                array (
                    'name' => 'Lottery_随机900级上品饰品',
                ),
            60120344 =>
                array (
                    'name' => 'Lottery_随机900级极品饰品',
                ),
            60120345 =>
                array (
                    'name' => 'Lottery_随机900级王品饰品',
                ),
            60120346 =>
                array (
                    'name' => 'Lottery_随机900级皇品饰品',
                ),
            60120347 =>
                array (
                    'name' => 'Lottery_随机900级帝品饰品',
                ),
            60120351 =>
                array (
                    'name' => 'Lottery_随机920级下品饰品',
                ),
            60120352 =>
                array (
                    'name' => 'Lottery_随机920级中品饰品',
                ),
            60120353 =>
                array (
                    'name' => 'Lottery_随机920级上品饰品',
                ),
            60120354 =>
                array (
                    'name' => 'Lottery_随机920级极品饰品',
                ),
            60120355 =>
                array (
                    'name' => 'Lottery_随机920级王品饰品',
                ),
            60120356 =>
                array (
                    'name' => 'Lottery_随机920级皇品饰品',
                ),
            60120357 =>
                array (
                    'name' => 'Lottery_随机920级帝品饰品',
                ),
            60120361 =>
                array (
                    'name' => 'Lottery_随机950级下品饰品',
                ),
            60120362 =>
                array (
                    'name' => 'Lottery_随机950级中品饰品',
                ),
            60120363 =>
                array (
                    'name' => 'Lottery_随机950级上品饰品',
                ),
            60120364 =>
                array (
                    'name' => 'Lottery_随机950级极品饰品',
                ),
            60120365 =>
                array (
                    'name' => 'Lottery_随机950级王品饰品',
                ),
            60120366 =>
                array (
                    'name' => 'Lottery_随机950级皇品饰品',
                ),
            60120367 =>
                array (
                    'name' => 'Lottery_随机950级帝品饰品',
                ),
            60120371 =>
                array (
                    'name' => 'Lottery_随机980级下品饰品',
                ),
            60120372 =>
                array (
                    'name' => 'Lottery_随机980级中品饰品',
                ),
            60120373 =>
                array (
                    'name' => 'Lottery_随机980级上品饰品',
                ),
            60120374 =>
                array (
                    'name' => 'Lottery_随机980级极品饰品',
                ),
            60120375 =>
                array (
                    'name' => 'Lottery_随机980级王品饰品',
                ),
            60120376 =>
                array (
                    'name' => 'Lottery_随机980级皇品饰品',
                ),
            60120377 =>
                array (
                    'name' => 'Lottery_随机980级帝品饰品',
                ),
            60120381 =>
                array (
                    'name' => 'Lottery_随机1000级下品饰品',
                ),
            60120382 =>
                array (
                    'name' => 'Lottery_随机1000级中品饰品',
                ),
            60120383 =>
                array (
                    'name' => 'Lottery_随机1000级上品饰品',
                ),
            60120384 =>
                array (
                    'name' => 'Lottery_随机1000级极品饰品',
                ),
            60120385 =>
                array (
                    'name' => 'Lottery_随机1000级王品饰品',
                ),
            60120386 =>
                array (
                    'name' => 'Lottery_随机1000级皇品饰品',
                ),
            60120387 =>
                array (
                    'name' => 'Lottery_随机1000级帝品饰品',
                ),
            6021001 =>
                array (
                    'name' => '动态等级_王品装备',
                ),
            6021002 =>
                array (
                    'name' => '动态等级_皇品装备',
                ),
            6021003 =>
                array (
                    'name' => '动态等级_帝品装备',
                ),
            6021004 =>
                array (
                    'name' => '动态等级_关卡扫荡装备',
                ),
            6021005 =>
                array (
                    'name' => '动态等级_关卡挑战装备',
                ),
            6021006 =>
                array (
                    'name' => '动态重置金额和次数_剑池契约召唤',
                ),
            7010001 =>
                array (
                    'name' => '手动刷新个人商店（事件）',
                ),
            7010003 =>
                array (
                    'name' => '关闭活动（个人活动事件）',
                ),
            7010004 =>
                array (
                    'name' => '通用TD改变（事件）',
                ),
            7010005 =>
                array (
                    'name' => '建设度',
                ),
            7010006 =>
                array (
                    'name' => '检查势力称号',
                ),
            7010007 =>
                array (
                    'name' => '剑池额外保底次数',
                ),
            7010008 =>
                array (
                    'name' => '开启活动（个人活动事件）',
                ),
            7010009 =>
                array (
                    'name' => '重置首充双倍',
                ),
            7010010 =>
                array (
                    'name' => '重置太古剑域层数',
                ),
            7010011 =>
                array (
                    'name' => '剑术试炼-复活',
                ),
            7010012 =>
                array (
                    'name' => '剑术试炼-随机招式',
                ),
            7010013 =>
                array (
                    'name' => '购买葬地挑战次数',
                ),
            7001001 =>
                array (
                    'name' => '要打架1累计',
                ),
            7001002 =>
                array (
                    'name' => '击败凌云弟子td',
                ),
            7001003 =>
                array (
                    'name' => '多选翻页',
                ),
            7001004 =>
                array (
                    'name' => '测试数据创建舞台',
                ),
            7011001 =>
                array (
                    'name' => '委托数据1',
                ),
            7011002 =>
                array (
                    'name' => '委托数据2',
                ),
            7011003 =>
                array (
                    'name' => '委托数据3',
                ),
            7011004 =>
                array (
                    'name' => '委托数据4',
                ),
            7011005 =>
                array (
                    'name' => '委托数据5',
                ),
            7011006 =>
                array (
                    'name' => '委托数据6',
                ),
            7011007 =>
                array (
                    'name' => '委托数据7',
                ),
            7011008 =>
                array (
                    'name' => '委托数据8',
                ),
            7002001 =>
                array (
                    'name' => '论剑次数',
                ),
            7002002 =>
                array (
                    'name' => '论剑积分',
                ),
            7002003 =>
                array (
                    'name' => '论剑排行榜被膜拜次数',
                ),
            7002004 =>
                array (
                    'name' => '论剑台冠军赛积分',
                ),
            7002005 =>
                array (
                    'name' => '任务通知系统开放',
                ),
            7002006 =>
                array (
                    'name' => '上古剑冢扫荡任务',
                ),
            7002007 =>
                array (
                    'name' => '签到顺序',
                ),
            7003001 =>
                array (
                    'name' => '创建舞台测试1',
                ),
            7003002 =>
                array (
                    'name' => '创建舞台测试2',
                ),
            7003003 =>
                array (
                    'name' => '创建舞台测试3',
                ),
            7003004 =>
                array (
                    'name' => '创建舞台测试4',
                ),
            7003005 =>
                array (
                    'name' => '创建舞台测试5',
                ),
            7003006 =>
                array (
                    'name' => '创建舞台测试6',
                ),
            7004001 =>
                array (
                    'name' => '前期目标开启数据1',
                ),
            7004002 =>
                array (
                    'name' => '前期目标开启数据2',
                ),
            7004003 =>
                array (
                    'name' => '前期目标开启数据3',
                ),
            7004004 =>
                array (
                    'name' => '前期目标开启数据4',
                ),
            7004005 =>
                array (
                    'name' => '前期目标开启数据5',
                ),
            7004006 =>
                array (
                    'name' => '集齐星曜剑阵',
                ),
            7004007 =>
                array (
                    'name' => '传送门成功开启',
                ),
            7005001 =>
                array (
                    'name' => '声望-太皇城',
                ),
            7005002 =>
                array (
                    'name' => '声望-太明城',
                ),
            7005003 =>
                array (
                    'name' => '声望-清明城',
                ),
            7005004 =>
                array (
                    'name' => '声望-玄胎城',
                ),
            7005005 =>
                array (
                    'name' => '声望-元明城',
                ),
            7005006 =>
                array (
                    'name' => '声望-七曜城',
                ),
            7005007 =>
                array (
                    'name' => '声望-虚无城',
                ),
            7005008 =>
                array (
                    'name' => '声望-八极城',
                ),
            7005009 =>
                array (
                    'name' => '声望-赤明城',
                ),
            7005010 =>
                array (
                    'name' => '声望-玄明城',
                ),
            7005011 =>
                array (
                    'name' => '声望-耀明城',
                ),
            7005012 =>
                array (
                    'name' => '声望-竺落城',
                ),
            7005013 =>
                array (
                    'name' => '声望-虚明城',
                ),
            7005014 =>
                array (
                    'name' => '声望-观明城',
                ),
            7005015 =>
                array (
                    'name' => '声望-玄明城',
                ),
            7005016 =>
                array (
                    'name' => '声望-太焕城',
                ),
            7005017 =>
                array (
                    'name' => '声望-元载城',
                ),
            7005018 =>
                array (
                    'name' => '声望-太安城',
                ),
            7005019 =>
                array (
                    'name' => '声望-显定城',
                ),
            7005020 =>
                array (
                    'name' => '声望-始黄城',
                ),
            7005021 =>
                array (
                    'name' => '声望-太黄城',
                ),
            7005022 =>
                array (
                    'name' => '声望-无思城',
                ),
            7005023 =>
                array (
                    'name' => '声望-上揲城',
                ),
            7005024 =>
                array (
                    'name' => '声望-无极城',
                ),
            7005025 =>
                array (
                    'name' => '声望-皓庭城',
                ),
            7005026 =>
                array (
                    'name' => '声望-渊通城',
                ),
            7005027 =>
                array (
                    'name' => '声望-翰宠城',
                ),
            7005028 =>
                array (
                    'name' => '声望-秀乐城',
                ),
            7005029 =>
                array (
                    'name' => '声望-无上城',
                ),
            7005030 =>
                array (
                    'name' => '声望-玉隆城',
                ),
            7005031 =>
                array (
                    'name' => '声望-龙变城',
                ),
            7005032 =>
                array (
                    'name' => '声望-平育城',
                ),
            7005033 =>
                array (
                    'name' => '声望-太清城',
                ),
            7005034 =>
                array (
                    'name' => '声望-上清城',
                ),
            7005035 =>
                array (
                    'name' => '声望-玉清城',
                ),
            7005036 =>
                array (
                    'name' => '声望-大罗域',
                ),
            7004201 =>
                array (
                    'name' => '观剑试炼',
                ),
            7004202 =>
                array (
                    'name' => '视剑试炼',
                ),
            7004203 =>
                array (
                    'name' => '听剑试炼',
                ),
            7004204 =>
                array (
                    'name' => '触剑试炼',
                ),
            7004205 =>
                array (
                    'name' => '意剑试炼',
                ),
            7004206 =>
                array (
                    'name' => '剑势试炼',
                ),
            7004207 =>
                array (
                    'name' => '剑意试炼',
                ),
            7004208 =>
                array (
                    'name' => '剑魄试炼',
                ),
            7004209 =>
                array (
                    'name' => '剑魂试炼',
                ),
            7004210 =>
                array (
                    'name' => '剑神试炼',
                ),
            7004301 =>
                array (
                    'name' => '神魔遗迹进度计数',
                ),
            7006001 =>
                array (
                    'name' => '礼包-6元日礼包',
                ),
            7006002 =>
                array (
                    'name' => '礼包-30元日礼包',
                ),
            7006003 =>
                array (
                    'name' => '礼包-98元日礼包',
                ),
            7006004 =>
                array (
                    'name' => '礼包-12元周礼包',
                ),
            7006005 =>
                array (
                    'name' => '礼包-68元周礼包',
                ),
            7006006 =>
                array (
                    'name' => '礼包-98元周礼包',
                ),
            7006007 =>
                array (
                    'name' => '礼包-30元月礼包',
                ),
            7006008 =>
                array (
                    'name' => '礼包-98元月礼包',
                ),
            7006009 =>
                array (
                    'name' => '礼包-198元月礼包',
                ),
            7001107 =>
                array (
                    'name' => '开启世界系统',
                ),
            7021115 =>
                array (
                    'name' => '太初神界（净胜场数）',
                ),
            7021116 =>
                array (
                    'name' => '本源元界（净胜场数）',
                ),
            7021117 =>
                array (
                    'name' => '太始魔界（净胜场数）',
                ),
            7026001 =>
                array (
                    'name' => '记录主线剧情进度',
                ),
            7026002 =>
                array (
                    'name' => '创建主线1舞台',
                ),
            7026003 =>
                array (
                    'name' => '创建主线2舞台',
                ),
            7026004 =>
                array (
                    'name' => '创建主线3舞台',
                ),
            7026005 =>
                array (
                    'name' => '创建主线4舞台',
                ),
            7026006 =>
                array (
                    'name' => '创建主线5舞台',
                ),
            7026007 =>
                array (
                    'name' => '创建主线6舞台',
                ),
            7026008 =>
                array (
                    'name' => '创建主线7舞台',
                ),
            7026009 =>
                array (
                    'name' => '创建主线8舞台',
                ),
            7026010 =>
                array (
                    'name' => '创建主线9舞台',
                ),
            7027001 =>
                array (
                    'name' => '主线剧情对话配置1',
                ),
            7027002 =>
                array (
                    'name' => '主线剧情对话配置2',
                ),
            7027003 =>
                array (
                    'name' => '主线剧情对话配置3',
                ),
            7027004 =>
                array (
                    'name' => '主线剧情对话配置4',
                ),
            7027005 =>
                array (
                    'name' => '主线剧情对话配置5',
                ),
            7027006 =>
                array (
                    'name' => '主线剧情对话配置6',
                ),
            7027007 =>
                array (
                    'name' => '主线剧情对话配置7',
                ),
            7027008 =>
                array (
                    'name' => '主线剧情对话配置8',
                ),
            7027009 =>
                array (
                    'name' => '主线剧情对话配置9',
                ),
            7027010 =>
                array (
                    'name' => '主线剧情对话配置10',
                ),
            7027011 =>
                array (
                    'name' => '主线剧情对话配置11',
                ),
            7027101 =>
                array (
                    'name' => '命为伊生找到遗书',
                ),
            7027102 =>
                array (
                    'name' => '黑幕-破阵解谜成功',
                ),
            7027103 =>
                array (
                    'name' => '黑幕-破阵解谜失败',
                ),
            7028001 =>
                array (
                    'name' => '激活掩日剑',
                ),
            7028002 =>
                array (
                    'name' => '激活惊月剑',
                ),
            7028003 =>
                array (
                    'name' => '激活摘星剑',
                ),
            7028004 =>
                array (
                    'name' => '激活破辰剑',
                ),
            7028005 =>
                array (
                    'name' => '激活大矩',
                ),
            7028006 =>
                array (
                    'name' => '激活煌灭',
                ),
            7028007 =>
                array (
                    'name' => '激活长目',
                ),
            7028008 =>
                array (
                    'name' => '激活不嗔',
                ),
            7028009 =>
                array (
                    'name' => '激活焚寂',
                ),
            7028010 =>
                array (
                    'name' => '激活彗蚀',
                ),
            7028011 =>
                array (
                    'name' => '激活绝云',
                ),
            7028012 =>
                array (
                    'name' => '激活承影',
                ),
            7028013 =>
                array (
                    'name' => '激活纯钧',
                ),
            7028014 =>
                array (
                    'name' => '激活鱼肠',
                ),
            7028015 =>
                array (
                    'name' => '激活莫邪',
                ),
            7028016 =>
                array (
                    'name' => '激活干将',
                ),
            7028017 =>
                array (
                    'name' => '激活七星龙渊',
                ),
            7028018 =>
                array (
                    'name' => '激活泰阿',
                ),
            7028019 =>
                array (
                    'name' => '激活赤霄',
                ),
            7028020 =>
                array (
                    'name' => '激活湛卢',
                ),
            7028021 =>
                array (
                    'name' => '激活轩辕夏禹',
                ),
            7028022 =>
                array (
                    'name' => '激活两仪灵剑',
                ),
            7028023 =>
                array (
                    'name' => '激活太阳剑',
                ),
            7028024 =>
                array (
                    'name' => '激活太阴剑',
                ),
            7028025 =>
                array (
                    'name' => '激活混沌圣剑',
                ),
            7028026 =>
                array (
                    'name' => '激活青萍剑',
                ),
            7028027 =>
                array (
                    'name' => '激活太乙剑',
                ),
            7028028 =>
                array (
                    'name' => '激活四宝剑',
                ),
            7028029 =>
                array (
                    'name' => '激活终焉神剑',
                ),
            7028030 =>
                array (
                    'name' => '激活离殇剑',
                ),
            7028031 =>
                array (
                    'name' => '激活空冥剑',
                ),
            7028032 =>
                array (
                    'name' => '激活湮灭剑',
                ),
            7028033 =>
                array (
                    'name' => '激活永寂剑',
                ),
            7028034 =>
                array (
                    'name' => '激活乾坤灵剑',
                ),
            7028035 =>
                array (
                    'name' => '激活大荒剑',
                ),
            7028036 =>
                array (
                    'name' => '激活囚天剑',
                ),
            7028037 =>
                array (
                    'name' => '激活苍穹圣剑',
                ),
            7028038 =>
                array (
                    'name' => '激活火莲剑',
                ),
            7028039 =>
                array (
                    'name' => '激活龙凰剑',
                ),
            7028040 =>
                array (
                    'name' => '激活帝焱剑',
                ),
            7028041 =>
                array (
                    'name' => '激活大主宰神剑',
                ),
            7028042 =>
                array (
                    'name' => '激活洛神剑',
                ),
            7028043 =>
                array (
                    'name' => '激活天帝剑',
                ),
            7028044 =>
                array (
                    'name' => '激活镇魔剑',
                ),
            7028045 =>
                array (
                    'name' => '激活须弥剑',
                ),
            7028046 =>
                array (
                    'name' => '激活太虚灵剑',
                ),
            7028047 =>
                array (
                    'name' => '激活无极剑',
                ),
            7028048 =>
                array (
                    'name' => '激活森罗剑',
                ),
            7028049 =>
                array (
                    'name' => '激活诸天圣剑',
                ),
            7028050 =>
                array (
                    'name' => '激活空痕剑',
                ),
            7028051 =>
                array (
                    'name' => '激活葬天剑',
                ),
            7028052 =>
                array (
                    'name' => '激活枯苍剑 ',
                ),
            7028053 =>
                array (
                    'name' => '激活诛仙神剑',
                ),
            7028054 =>
                array (
                    'name' => '激活合欢剑',
                ),
            7028055 =>
                array (
                    'name' => '激活天琊剑',
                ),
            7028056 =>
                array (
                    'name' => '激活噬魂剑',
                ),
            7028057 =>
                array (
                    'name' => '激活鬼王剑',
                ),
            7050001 =>
                array (
                    'name' => '月卡福利激活',
                ),
            7050002 =>
                array (
                    'name' => '掌控者战-掌控者激活',
                ),
            7050003 =>
                array (
                    'name' => '掌控者战-统帅者激活',
                ),
            7050004 =>
                array (
                    'name' => '掌控者战-执行者激活',
                ),
            7050005 =>
                array (
                    'name' => '掌控者战-亲随激活',
                ),
            7060001 =>
                array (
                    'name' => '月卡扫荡收益',
                ),
            7060002 =>
                array (
                    'name' => '掌控者战-掌控者扫荡收益',
                ),
            7060003 =>
                array (
                    'name' => '掌控者战-统帅者扫荡收益',
                ),
            7060004 =>
                array (
                    'name' => '掌控者战-执行者扫荡收益',
                ),
            7060005 =>
                array (
                    'name' => '掌控者战-亲随扫荡收益',
                ),
            7070001 =>
                array (
                    'name' => '神秘商店免费购买次数',
                ),
            7080001 =>
                array (
                    'name' => '神秘商店免费购买次数上限',
                ),
            7091001 =>
                array (
                    'name' => '30分钟扫荡收益券',
                ),
            7091002 =>
                array (
                    'name' => '1小时扫荡收益券',
                ),
            7091003 =>
                array (
                    'name' => '2小时扫荡收益券',
                ),
            7091004 =>
                array (
                    'name' => '4小时扫荡收益券',
                ),
            7091005 =>
                array (
                    'name' => '8小时扫荡收益券',
                ),
            7101001 =>
                array (
                    'name' => '交互flag标号_21101',
                ),
            7101002 =>
                array (
                    'name' => '交互flag标号_21102',
                ),
            7111001 =>
                array (
                    'name' => '交互顺序标号',
                ),
            7121001 =>
                array (
                    'name' => '计步器',
                ),
            7131001 =>
                array (
                    'name' => '任命掌控者',
                ),
            7131002 =>
                array (
                    'name' => '任命统帅者',
                ),
            7131003 =>
                array (
                    'name' => '任命执行者',
                ),
            7131004 =>
                array (
                    'name' => '任命亲随',
                ),
            8012001 =>
                array (
                    'name' => '基础-生命',
                ),
            8012002 =>
                array (
                    'name' => '基础-攻击',
                ),
            8012003 =>
                array (
                    'name' => '基础-防御',
                ),
            8012011 =>
                array (
                    'name' => '基础-命中',
                ),
            8012012 =>
                array (
                    'name' => '基础-闪避',
                ),
            8012013 =>
                array (
                    'name' => '基础-暴击',
                ),
            8012014 =>
                array (
                    'name' => '基础-韧性',
                ),
            8012015 =>
                array (
                    'name' => '基础-破击',
                ),
            8012016 =>
                array (
                    'name' => '基础-格挡',
                ),
            8012021 =>
                array (
                    'name' => '基础-速度值',
                ),
            8012022 =>
                array (
                    'name' => '基础-真气值',
                ),
            8012023 =>
                array (
                    'name' => '基础-剑气值',
                ),
            8012031 =>
                array (
                    'name' => '基础-命中几率',
                ),
            8012032 =>
                array (
                    'name' => '基础-闪避几率',
                ),
            8012033 =>
                array (
                    'name' => '基础-暴击几率',
                ),
            8012034 =>
                array (
                    'name' => '基础-抗暴几率',
                ),
            8012035 =>
                array (
                    'name' => '基础-破击几率',
                ),
            8012036 =>
                array (
                    'name' => '基础-格挡几率',
                ),
            8012041 =>
                array (
                    'name' => '基础-暴击倍率',
                ),
            8012042 =>
                array (
                    'name' => '基础-守护倍率',
                ),
            8012043 =>
                array (
                    'name' => '基础-吸血比例',
                ),
            8012044 =>
                array (
                    'name' => '基础-增伤比例',
                ),
            8012045 =>
                array (
                    'name' => '基础-减伤比例',
                ),
            2037001 =>
                array (
                    'name' => '遗书',
                ),
            2037002 =>
                array (
                    'name' => '怨念逆鳞',
                ),
            2037003 =>
                array (
                    'name' => '玄火鉴',
                ),
            2037004 =>
                array (
                    'name' => '密道钥匙',
                ),
            2037101 =>
                array (
                    'name' => '遗书',
                ),
            2037102 =>
                array (
                    'name' => '怨念逆鳞',
                ),
            2037103 =>
                array (
                    'name' => '玄火鉴',
                ),
            2037104 =>
                array (
                    'name' => '密道钥匙',
                ),
            2037005 =>
                array (
                    'name' => '姬玄普通版已击败',
                ),
            2037006 =>
                array (
                    'name' => '姬玄信物',
                ),
            2037007 =>
                array (
                    'name' => '牧尘的诚意',
                ),
            2037008 =>
                array (
                    'name' => '牧尘信物',
                ),
            2037009 =>
                array (
                    'name' => '火云果判定物',
                ),
            2037010 =>
                array (
                    'name' => '火云果',
                ),
        );
        $goods = array();

        foreach ($Item as $key=>$value) {
            array_push($goods, array('id' => $key, 'good_name' => $value['name']));
        }

        DB::table('goods')->insert($goods);

    }

    public function index(Request $request, Account $account, Manager $manager)
    {
        $username = $request->input('username', null);
        $password = $request->input('password', null);

        $user = $account->where(['account_name' => $username])->first();

        if (!$user){
            return response(Response::Error(trans('ResponseMsg.USER_NOT_EXIST'), 20004));
        }

        if (!$user->status){
            return response(Response::Error(trans('ResponseMsg.USER_ACCOUNT_FORBIDDEN'), 20003));
        }

        if (!password_verify($password, $user->password)){
            return response(Response::Error(trans('ResponseMsg.USER_LOGIN_ERROR'), 20002));
        }

        $menu = $manager->where(['id' => $user->manager_id])->first();

        $Token = $this->setLoginToken($user);
        $Token['game'] = $user->game;
        $Token['manager_id'] = $user->manager_id;
        $Token['menu'] = json_decode($menu->menu, true);
        $Token['name'] = $user->real_name;

        $channel = array();
        $tags = json_decode($user->channel, true);
        if ($tags) {
            foreach ($tags as $val) {
                $channel[] = json_decode($val, true);
            }
        }
        $Token['channel'] = $channel;

        return response(Response::Success($Token));
    }

    public function getMenus(Request $request, MenuService $menuService)
    {
        $game_id    = $request->input('game_id');
        $manager_id = $request->input('manager_id');

        $menu = $menuService->getAdministratorMenu($manager_id, $game_id);

        $data = [
            'menu' => $menu
        ];

        define('GID', $game_id);

        return response(Response::Success($data));
    }

    protected function setLoginToken($user)
    {
        $Token = [
            'user_id'   => $user->id,
            'time'      => time(),
        ];

        $Encryption = new Encryption();

        $Token = $Encryption->encode(json_encode($Token));

        Redis::set($Token, time());
        Redis::expire($Token, 604800);

        return ['Token' => $Token];
    }
}
